{
    "ScanNet: scene0000_00": {
        "objects_info": [
            {
                "id": "45",
                "label": "toaster oven",
                "position": [
                    2.9869223439100008,
                    1.8908700696849996,
                    1.019238
                ],
                "size": [
                    0.4916315478599991,
                    0.7079358395500002,
                    0.3064040000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/45-toaster oven.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The toaster oven lies below the kitchen cabinets, which are elevated above the dish rack.",
                        "The toaster oven can be found below the microwave, which is positioned above the kitchen counter.",
                        "The toaster oven, a sleek and modern kitchen appliance, is strategically placed below the microwave and kitchen cabinets, maximizing the usage of space while maintaining a stylish appearance, and it's also conveniently hanging on the wall, offering an added layer of comfort and accessibility for the busy home cook.",
                        "The toaster oven, located beneath the microwave and kitchen cabinets, provides a convenient and comfortable cooking experience for culinary enthusiasts."
                    ],
                    "template": [
                        "The kitchen cabinets is higher than the dish rack , while The toaster oven is lower than the kitchen cabinets",
                        "The microwave is above the kitchen counter , and The toaster oven is lower than the microwave",
                        "The toaster oven is lower than the microwave and kitchen cabinets , it is also hanging on wall .",
                        "The toaster oven is hanging on the wall , and The toaster oven is lower than the microwave and kitchen cabinets  ."
                    ],
                    "obj_cap": [
                        "A black and silver toaster oven with a smooth surface and an oblong shape. It is made of stainless steel and has a toaster oven function."
                    ]
                }
            },
            {
                "id": "26",
                "label": "wall",
                "position": [
                    1.1282494084950003,
                    -2.48264080261,
                    1.28948525
                ],
                "size": [
                    0.9049864396700018,
                    1.99085042018,
                    2.6545894999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/26-wall.obj"
            },
            {
                "id": "29",
                "label": "stool",
                "position": [
                    1.3246540873300003,
                    2.0019511669399996,
                    0.38497264999999997
                ],
                "size": [
                    0.4068937074799992,
                    0.4427303422999991,
                    0.7169407
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/29-stool.obj",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The stool is situated in front of the sink, which is positioned below the mirror.",
                        "The guitar case is positioned on the floor, with the stool conveniently located behind it, providing a comfortable seating option for musicians as they strum their strings, while the nightstand nearby offers a place to rest their weary heads.",
                        "The stool, positioned to the left of the refrigerator and trash can, serves as a convenient seat for meal preparation and waste disposal, while its placement in front of the bed allows for a comfortable spot to relax and unwind."
                    ],
                    "template": [
                        "The sink is below the mirror , and The stool is in front of the sink",
                        "The stool is behind the guitar case  and is placed on floor, also is in front of nightstand .",
                        "The stool is to the left of the refrigerator and trash can , what's more, The stool is in front of the bed  ."
                    ],
                    "obj_cap": [
                        "The stool is a wooden, oblong-shaped seat with a smooth, wooden texture and a structure that consists of four wooden legs. It can be used as a bar stool or in a restaurant setting."
                    ],
                    "anno": [
                        "the second stool, from left to right",
                        "the second stool in from the left",
                        "Looking at the stools from the kitchen side, it is the second one from the left.",
                        "Choose the 2nd stool from the left.",
                        "Facing the four stools tucked under the breakfast bar, you need to select the stool that is second from the left.",
                        "With the counter in front of you, it's the 2nd stool from the left.",
                        "I am second closest stool to the bathroom"
                    ]
                }
            },
            {
                "id": "9",
                "label": "floor",
                "position": [
                    -0.0853063813624999,
                    0.010172848629499853,
                    0.113635716
                ],
                "size": [
                    6.794164725525,
                    6.844241738520999,
                    0.35714056799999994
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/9-floor.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Ahem, my dear fellow, the floor, that sturdy foundation upon which the sink rests, lies beneath the mirror's gaze, a subtle yet stalwart support for the porcelain vessel.",
                        "The floor, which serves as a foundation for the shoes, desk, and cabinet, provides a comfortable and stable surface for various human activities."
                    ],
                    "template": [
                        "The sink is below the mirror , while The floor supports the sink",
                        "supporting the shoes and desk and cabinet is a floor ."
                    ]
                }
            },
            {
                "id": "39",
                "label": "cabinet",
                "position": [
                    -3.150149423105,
                    -2.9052595143725,
                    0.940144
                ],
                "size": [
                    0.6012547311499996,
                    1.2178768840650003,
                    1.938112
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/39-cabinet.obj",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "Locate the sink below the mirror, then look to its left to find the cabinet.",
                        "The cabinet, which serves as a convenient storage space for various items, is located to the left of the stool and trash can, and its surface is at a comfortable height for easy accessibility, while also being positioned behind the table to blend seamlessly into the surrounding environment.",
                        "Behind the shoes, a cabinet blends seamlessly into the kitchen layout, its doors concealing an assortment of utensils and cookware, while its sleek design and proximity to the refrigerator facilitate efficient meal preparation."
                    ],
                    "template": [
                        "The sink is below the mirror , and The cabinet is to the left of the sink",
                        "The cabinet is to the left of the stool and trash can , what's more, The cabinet is behind the table  .",
                        "to the left of the refrigerator is the cabinet , and The cabinet is behind the shoes and cabinet  ."
                    ],
                    "obj_cap": [
                        "The cabinet is a white, cube-shaped storage space made of cloth and wood, with a door on the side that is open. It can be used to store clothes and has a smooth, white texture."
                    ],
                    "anno": [
                        "The correct cabinet is tall, white and in the corner.",
                        "The correct cabinet has white curtains hanging on the front of it.",
                        "the white curtained cabinet",
                        "cabinet in corner beside desk",
                        "If you come through the door into the room, you'll see the curtains and bike directly opposite you, and you want the cabinets directly to the right of them.",
                        "Facing the foot of the bed, the cabinet in the far upper right corner."
                    ]
                }
            },
            {
                "id": "62",
                "label": "object",
                "position": [
                    -0.5884434192649999,
                    -2.1054687015450004,
                    0.8175745
                ],
                "size": [
                    0.6187396225499997,
                    0.77507208851,
                    0.199519
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/62-object.obj",
                "caption": {
                    "obj_cap": [
                        "A black leather backpack with a spherical shape, smooth texture, and a bag-like structure, used for carrying personal items."
                    ]
                }
            },
            {
                "id": "52",
                "label": "microwave",
                "position": [
                    2.9985653406850004,
                    1.952395765025,
                    1.646455
                ],
                "size": [
                    0.4896143623300002,
                    0.6162025464299994,
                    0.45275
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/52-microwave.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The microwave is positioned above the toaster oven, which is located below the kitchen cabinets.",
                        "The sleek microwave sits proudly on the wall, its gleaming surface reflecting the bustling activity below as it efficiently heats up leftovers and snacks, its user-friendly interface making it easy to operate from the comfort of the kitchen counter, while the toaster oven hums along quietly beneath it, complementing the microwave's function with its own culinary prowess."
                    ],
                    "template": [
                        "The toaster oven is lower than the kitchen cabinets , while The microwave is higher than the toaster oven",
                        "The microwave is hung on the wall  and is above kitchen counter, also is higher than toaster oven ."
                    ],
                    "obj_cap": [
                        "The microwave is a white, oblong-shaped kitchen appliance made of stainless steel and plastic. It has a smooth texture and a waveguide structure, used for cooking food."
                    ]
                }
            },
            {
                "id": "57",
                "label": "bicycle",
                "position": [
                    -3.2602777776459995,
                    1.1121022869289998,
                    0.4069914
                ],
                "size": [
                    0.4790763482439999,
                    1.3795219819979998,
                    0.8525811999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/57-bicycle.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "As you stand in front of the cabinet, your gaze falls upon the sink, positioned below the mirror, and to its right, you notice a bicycle nestled against the wall, awaiting its next adventure.",
                        "The bicycle, positioned to the left of the stool, table, and shower, serves as a convenient mode of transportation for the occupant, offering a comfortable ride and efficient way to navigate the surrounding area.",
                        "The bicycle, serving as a reliable mode of transportation and a stylish piece of home decor, leans against the wall to the left of the comfortable couch, its sleek frame and shiny wheels catching the eye and adding a touch of modernity to the room's aesthetic, while nearby, a pair of shoes and a bed add a cozy touch to the scene."
                    ],
                    "template": [
                        "The sink is below the mirror , while Standing in front of the cabinet, to the right of the sink is the bicycle",
                        "The bicycle is to the left of the stool and table and shower .",
                        "The bicycle is to the left of the couch , and The bicycle is in front of the bed and shoes  ."
                    ],
                    "obj_cap": [
                        "The bicycle is a silver and white triangular-shaped vehicle made of stainless steel and steel, used for commuting and casual rides, with a shiny and smooth texture, and a structure featuring a seat and handlebars."
                    ]
                }
            },
            {
                "id": "55",
                "label": "ceiling",
                "position": [
                    -0.10980812178544941,
                    -0.0667482993365005,
                    2.6449949999999998
                ],
                "size": [
                    6.712985057830901,
                    7.046785402453,
                    0.6265900000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/55-ceiling.obj"
            },
            {
                "id": "40",
                "label": "kitchen cabinets",
                "position": [
                    2.9277083596050004,
                    1.3029704808449993,
                    2.0529849999999996
                ],
                "size": [
                    0.6649607689900003,
                    0.9761193371899997,
                    0.6596499999999996
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/40-kitchen cabinets.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The kitchen cabinets are made of wood and have a light wood color. They have a crown molding on the top and are used for storage. They have a white countertop and a refrigerator in the kitchen. They are painted in a light brown color and have a wooden texture."
                    ],
                    "anno": [
                        "The cabinet above the refrigerator.",
                        "The cabinet is the one above the fridge.",
                        "The small cabinet over the fridge",
                        "These cabinets are above the refrigerator.",
                        "It is the cabinet above the refrigerator.",
                        "The cabinets that are above the refrigerator",
                        "It is the cabinet directly above the fridge."
                    ]
                }
            },
            {
                "id": "64",
                "label": "mirror",
                "position": [
                    3.2888470733800004,
                    -2.1521570850550003,
                    1.5497900000000002
                ],
                "size": [
                    0.18470230724000025,
                    0.5008588642100003,
                    0.52132
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/64-mirror.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The mirror is situated above the sink, which is behind the stool.",
                        "Mirror, a shimmering mirage, hovers ethereally above the sink, its presence evoking a sense of otherworldly wonder.",
                        "The mirror is situated above the sink, which is to the right of the cabinet.",
                        "The mirror is situated above the sink, which is to the right of the bicycle.",
                        "The mirror glints above the backpack, a shimmering beacon to your grooming needs.",
                        "The mirror is situated above the sink, which is to the right of the shoes.",
                        "The mirror is situated above the sink, which is to the right of the desk.",
                        "To locate the mirror from the shelf, follow the line of sight upward from the sink, which is positioned behind the shelf, and the mirror will be at a higher elevation than the sink.",
                        "The mirror is situated above the sink, which is positioned behind the stool.",
                        "The mirror is positioned above the sink, to the right of the cabinet.",
                        "The mirror is positioned above the sink, which is concealed behind the guitar case.",
                        "The mirror is situated above the sink, which is to the right of the table.",
                        "The mirror hangs above the sink, which is to the right of the nightstand.",
                        "The mirror hangs above the sink, which is situated behind the stool.",
                        "Locate the sink behind the cabinet, and you'll find the mirror situated above it, reflecting its surroundings with precision.",
                        "The mirror glints above the sink, its reflection gleaming just above the trash can's rim.",
                        "The mirror is situated above the sink, which is positioned behind the table.",
                        "The mirror is situated above the sink, which is positioned behind the cabinet.",
                        "Locate the sink behind the trash can, then glance upwards to spot the mirror, positioned at a higher elevation than the sink.",
                        "The mirror gracefully rises above the coffee table, parallel to the sink, inviting you to gaze into its reflective surface.",
                        "The mirror is situated above the sink, which is to the right of the bed.",
                        "The mirror is positioned above the sink, which is situated in front of the toilet.",
                        "The mirror is situated above the sink, which is to the right of the shower.",
                        "The mirror is situated above the sink, which is to the right of the laundry basket.",
                        "To locate the mirror from the couch, look upwards and backwards, it's placed higher than the sink which is behind the couch.",
                        "The mirror is situated above the sink, which is to the right of the scale.",
                        "The mirror is situated above the sink, which is to the right of the guitar.",
                        "The mirror hangs above the sink, which is located behind the stool.",
                        "The mirror glints above the trash can, its reflection gleaming behind the sink.",
                        "The mirror is positioned above the sink, which is situated behind the refrigerator."
                    ],
                    "template": [
                        "The sink is behind the stool , while The mirror is higher than the sink",
                        "The sink is on the floor , while The mirror is higher than the sink",
                        "The sink is to the right of the cabinet , while The mirror is higher than the sink",
                        "The sink is to the right of the bicycle , while The mirror is higher than the sink",
                        "The sink is to the right of the backpack , while The mirror is higher than the sink",
                        "The sink is to the right of the shoes , while The mirror is higher than the sink",
                        "to the right of the desk is the sink , while The mirror is higher than the sink",
                        "The sink is behind the shelf , and The mirror is higher than the sink",
                        "The sink is behind the stool , and The mirror is higher than the sink",
                        "The sink is to the right of the cabinet , while The mirror is higher than the sink",
                        "The sink is behind the guitar case , and The mirror is higher than the sink",
                        "The sink is to the right of the table , and The mirror is higher than the sink",
                        "The sink is to the right of the nightstand , and higher than the sink is the mirror",
                        "The sink is behind the stool , while higher than the sink is the mirror",
                        "The sink is behind the cabinet , while higher than the sink is the mirror",
                        "The sink is to the right of the trash can , while The mirror is higher than the sink",
                        "The sink is behind the table , and The mirror is higher than the sink",
                        "The sink is behind the cabinet , while higher than the sink is the mirror",
                        "The sink is behind the trash can , and The mirror is higher than the sink",
                        "The sink is behind the coffee table , and The mirror is higher than the sink",
                        "The sink is to the right of the bed , and The mirror is higher than the sink",
                        "The sink is in front of the toilet , and The mirror is higher than the sink",
                        "The sink is to the right of the shower , while The mirror is higher than the sink",
                        "The sink is to the right of the laundry basket , while The mirror is higher than the sink",
                        "The sink is behind the couch , and The mirror is higher than the sink",
                        "The sink is to the right of the scale , and The mirror is higher than the sink",
                        "The sink is to the right of the guitar , and higher than the sink is the mirror",
                        "behind the stool is the sink , while higher than the sink is the mirror",
                        "The sink is behind the trash can , while The mirror is higher than the sink",
                        "The sink is behind the refrigerator , while The mirror is higher than the sink"
                    ],
                    "obj_cap": [
                        "The mirror is a rectangular glass mirror with a black frame, occasional smudges, and a shiny surface. It can be used to see oneself or what's in front, and some versions have a light or a frame on it. It's typically hung on a wall."
                    ]
                }
            },
            {
                "id": "27",
                "label": "wall",
                "position": [
                    2.64457625436,
                    -3.4357866253850005,
                    0.9191059
                ],
                "size": [
                    1.3662590752399995,
                    0.2855517326700001,
                    1.9028882000000003
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/27-wall.obj"
            },
            {
                "id": "25",
                "label": "wall",
                "position": [
                    2.3931602932100007,
                    -1.5213151381800003,
                    1.38059235
                ],
                "size": [
                    1.8484094840400003,
                    0.17093463659999952,
                    2.8152353
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/25-wall.obj"
            },
            {
                "id": "23",
                "label": "wall",
                "position": [
                    3.1447686695900003,
                    0.9425730647749999,
                    1.4859307499999999
                ],
                "size": [
                    0.4402344192600012,
                    4.90459174613,
                    2.9490184999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/23-wall.obj"
            },
            {
                "id": "18",
                "label": "backpack",
                "position": [
                    -1.8681717246349996,
                    0.42514658687499973,
                    0.21890375
                ],
                "size": [
                    0.47825804521000004,
                    0.3533094604299998,
                    0.4625905
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/18-backpack.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The backpack can be found to the left of the sink, which is situated below the mirror.",
                        "The backpack, a sturdy and spacious companion, sits proudly to the left of the guitar case and refrigerator, its zippers and buckles glistening in the light, while its comfortable shoulder straps beckon to be worn, ready to carry all the essentials for a day of adventure, its presence also conveniently near the trash can, allowing for easy disposal of any unnecessary items.",
                        "The backpack, a sturdy and spacious companion, sits proudly to the left of the cabinet, nestled between the comforting couch and the useful laundry basket, awaiting its next adventure."
                    ],
                    "template": [
                        "The sink is below the mirror , and The backpack is to the left of the sink",
                        "The backpack is to the left of the guitar case and refrigerator , what's more, The backpack is in front of the trash can  .",
                        "The backpack is to the left of the cabinet  and is next to couch, also is in front of laundry basket ."
                    ],
                    "obj_cap": [
                        "A black leather backpack with a sleek oblong shape, used for carrying laptops and other items, featuring a textured leather surface and a sturdy structure."
                    ]
                }
            },
            {
                "id": "17",
                "label": "clock",
                "position": [
                    -3.4510514361249998,
                    -2.3897725263405003,
                    1.793325
                ],
                "size": [
                    0.0423872691899998,
                    0.3332147586609997,
                    0.41459
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/17-clock.obj",
                "count": 1,
                "caption": ""
            },
            {
                "id": "58",
                "label": "shoes",
                "position": [
                    -3.2422910956499997,
                    -1.1691751329300004,
                    0.04850895
                ],
                "size": [
                    0.22930060227999993,
                    0.2010345388999999,
                    0.09668610000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/58-shoes.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The shoes can be found to the left of the sink, which is situated below the mirror and directly facing the bicycle.",
                        "The sneakers are positioned conveniently to the left of the trash can, stool, and cabinet, within easy reach for a quick put-on or take-off, and their soft cushioning and supportive arches promise a comfortable fit for cycling enthusiasts.",
                        "The sleek black shoes, designed for cycling, are strategically positioned to the left of the stool and scale, providing easy access for weighing and storing your bike, while also being conveniently located behind the backpack, ensuring a seamless transition between cycling and other outdoor activities."
                    ],
                    "template": [
                        "The sink is below the mirror , while Directly facing the bicycle, The shoes is to the left of the sink",
                        "Facing the bicycle, The shoes is to the left of the trash can and stool and cabinet .",
                        "Standing in front of the bicycle, The shoes is to the left of the stool and scale , it is also behind backpack ."
                    ]
                }
            },
            {
                "id": "7",
                "label": "desk",
                "position": [
                    -2.194494173939,
                    -3.1402092968275,
                    0.49111745000000007
                ],
                "size": [
                    1.4801223385900002,
                    0.686760439201,
                    1.0585651000000003
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/7-desk.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The desk is located to the left of the sink, which is situated below the mirror and facing towards the backpack.",
                        "The desk, located adjacent to the bicycle and guitar, stands proudly behind the stool and in close proximity to the nightstand, serving as a functional workspace and contributing to the cozy ambiance of the room.",
                        "The desk, located behind the couch and coffee table, and adjacent to the nightstand, is a convenient workspace that can be used for various tasks, such as writing, reading, or organizing items, while also providing a comfortable surface for humans to work or study."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the backpack, The desk is to the left of the sink",
                        "Standing in front of the bicycle, to the left of the guitar is the desk  and is behind stool, also is close to nightstand .",
                        "Standing in front of the bicycle, The desk is behind the couch and coffee table , what's more, close to the nightstand is the desk  ."
                    ],
                    "obj_cap": [
                        "Brown octagonal wooden computer desk with a chair, used for working on a computer."
                    ]
                }
            },
            {
                "id": "56",
                "label": "shelf",
                "position": [
                    -0.6421608353099995,
                    3.1117152829299997,
                    1.14076435
                ],
                "size": [
                    3.0008214131800006,
                    0.59315773368,
                    2.3536313
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/56-shelf.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The shelf is situated in the forefront of the sink, which is positioned below the mirror.",
                        "The shelf, located conveniently in front of the sink and scale, and to the left of a sturdy stool, serves as a versatile storage space for various kitchen essentials, ensuring easy accessibility and efficient use of space, while also providing a comfortable and functional work area for food preparation and cooking activities.",
                        "The shelf, located to the left of the table and refrigerator, serves as a convenient storage space for various items, while also providing a comfortable display area for the guitar, inviting humans to engage in musical activities."
                    ],
                    "template": [
                        "The sink is below the mirror , while The shelf is in front of the sink",
                        "The shelf is in front of the sink and scale , it is also to the left of stool .",
                        "The shelf is to the left of the table and refrigerator , it is also in front of guitar ."
                    ],
                    "obj_cap": [
                        "The shelf is a wooden bookcase with a beige or brown finish, an octagonal or cubic shape, and a smooth, wooden texture. It is used to store books and has a simple, functional design."
                    ]
                }
            },
            {
                "id": "54",
                "label": "door",
                "position": [
                    3.3561653737000006,
                    -0.023239885395000215,
                    0.9520426000000001
                ],
                "size": [
                    0.09864898870000083,
                    0.680801552190001,
                    1.9182348000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/54-door.obj",
                "caption": {
                    "obj_cap": [
                        "The door is a white, octagon-shaped, double door with a smooth texture and a knob on it. It is made of white material and is used as a front door or garage door."
                    ]
                }
            },
            {
                "id": "24",
                "label": "wall",
                "position": [
                    3.2310086022049997,
                    -2.6571090091850005,
                    1.2503655
                ],
                "size": [
                    0.2559148762899994,
                    1.55151556121,
                    2.516649
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/24-wall.obj"
            },
            {
                "id": "28",
                "label": "stool",
                "position": [
                    1.297932419835,
                    1.5184783935199997,
                    0.37719695
                ],
                "size": [
                    0.3671746219699994,
                    0.4334368993600002,
                    0.7088920999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/28-stool.obj",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The stool can be found adjacent to the sink, which is positioned in front of the mirror.",
                        "The stool is positioned conveniently between the trash can and refrigerator, with the table nearby, providing ample space for comfortable seating and easy access to surrounding amenities.",
                        "The stool, positioned conveniently in front of the shower, serves as a practical step stool for easy access to the showerhead, and its proximity to the trash can and cabinet ensures efficient waste disposal and storage, offering a comfortable and functional experience for the user."
                    ],
                    "template": [
                        "below the mirror is the sink , while in front of the sink is the stool",
                        "Standing in front of the stool, The stool is in front of the trash can  and is to the left of refrigerator, also is to the right of table .",
                        "Standing in front of the stool, The stool is in front of the shower  and is to the left of trash can, also is to the right of cabinet ."
                    ],
                    "obj_cap": [
                        "The stool is a wooden oblong seat with four wooden legs, used as a kitchen or bar stool. It has a smooth wooden texture and a simple wooden structure."
                    ],
                    "anno": [
                        "Stools at end of bar closest to the couch",
                        "This is the outer-most stool, furthest from the wall.",
                        "When looking at the stools in a row (looking at the back of the couch), the far left.",
                        "The stool is closer to the couch edge than the wall",
                        "This bar stool is on the end. It is the stool closest to the middle of the room.",
                        "Choose the stool that is at the end of the bar across from the refridgerator.",
                        "The correct stool is farthest from the windows, closest to toilet."
                    ]
                }
            },
            {
                "id": "8",
                "label": "cabinet",
                "position": [
                    -2.7552804884319997,
                    2.405456195956,
                    1.1390041499999999
                ],
                "size": [
                    1.4764170163039996,
                    1.4926970990679997,
                    2.3379516999999996
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/8-cabinet.obj",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "Locate the sink below the mirror, and then turn right to find the cabinet adjacent to it, facing the desk.",
                        "The cabinet, located to the left of the trash can and stool, serves as a convenient storage space for bathroom essentials and is positioned at a comfortable height for easy access, while also being situated in front of the shower for efficient use during bathing routines.",
                        "The cabinet, located to the left of the sink and in front of the nightstand, serves as a convenient storage space for bathroom essentials, with its proximity to the shelf allowing for easy access to additional items."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing the desk, The cabinet is to the right of the sink",
                        "The cabinet is to the left of the trash can and stool , what's more, The cabinet is in front of the shower  .",
                        "The cabinet is to the left of the sink  and is in front of nightstand, also is next to shelf ."
                    ],
                    "obj_cap": [
                        "Brown wooden TV cabinet with a triangular shape and a built-in entertainment center."
                    ],
                    "anno": [
                        "The cabinet in the corner of the room next to the green curtains",
                        "The cabinet closest to the bicycle.",
                        "Choose the cabinet that contains the TV.",
                        "the cabinet that contains the fireplace",
                        "Cabinet at an angle, with a TV inside in the room with the couch",
                        "The cabinet beside the bike.",
                        "The cabinet in the corner of the living room."
                    ]
                }
            },
            {
                "id": "66",
                "label": "guitar case",
                "position": [
                    0.6935429503899999,
                    2.7450409912199993,
                    0.46402065000000003
                ],
                "size": [
                    0.7209662126399996,
                    0.38656930665999933,
                    0.9886187
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/66-guitar case.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The guitar case is situated in front of the sink, which is positioned below the mirror.",
                        "The guitar case, positioned beside the shelf and to the right of the coffee table, commands attention with its sleek design, while its proximity to the shower hints at the possibility of a musical interlude during bath time, creating a comfortable and functional space for relaxation and entertainment."
                    ],
                    "template": [
                        "The sink is below the mirror , and The guitar case is in front of the sink",
                        "The guitar case is beside the shelf  and is to the right of coffee table, also is in front of shower ."
                    ],
                    "obj_cap": [
                        "The guitar case is a brown, octagonal, leather case used to store and carry a guitar. It has a smooth texture and is made of wood."
                    ]
                }
            },
            {
                "id": "65",
                "label": "doorframe",
                "position": [
                    3.3005467035700002,
                    -0.046319342160000554,
                    0.9813702
                ],
                "size": [
                    0.19491030150000022,
                    0.7770557067400001,
                    1.9579795999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/65-doorframe.obj",
                "caption": {
                    "obj_cap": [
                        "The doorframe is a white, octagonal, wooden frame with a smooth texture and a front door usage. It has a wooden structure and a doorknob."
                    ]
                }
            },
            {
                "id": "59",
                "label": "object",
                "position": [
                    -1.61248710448,
                    -3.249269320342,
                    0.5303614999999999
                ],
                "size": [
                    0.16158256822799988,
                    0.42957100824399985,
                    0.673957
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/59-object.obj",
                "caption": {
                    "obj_cap": [
                        "A black leather phone case, a brown leather chair, a wooden chair, a person's hand, and a TV screen."
                    ]
                }
            },
            {
                "id": "35",
                "label": "table",
                "position": [
                    -3.1743043560799995,
                    -2.0409706215700005,
                    0.25359929999999997
                ],
                "size": [
                    0.4902882704200002,
                    1.06023151048,
                    0.5020654
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/35-table.obj",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "As you stand in front of the cabinet, the table is situated to the left of the sink, below the mirror.",
                        "The table, located behind the couch and to the left of the trash can, serves as a convenient surface for placing items and can be accessed easily while standing in front of the bicycle.",
                        "The table, positioned to the left of the nightstand and stool, serves as a convenient workspace for residents, while also providing a comfortable spot to place a cup of coffee or book, and is located behind the couch, creating a cozy and inviting atmosphere in the room."
                    ],
                    "template": [
                        "The sink is below the mirror , while Standing in front of the cabinet, The table is to the left of the sink",
                        "Standing in front of the bicycle, The table is behind the couch , and The table is to the left of the table and trash can  .",
                        "Facing towards the bicycle, The table is to the left of the nightstand and stool , it is also behind couch ."
                    ],
                    "obj_cap": [
                        "White, wooden, triangle-shaped table with a smooth texture and simple structure, often used as a bedside table, desk, or coffee table."
                    ],
                    "anno": [
                        "Facing the bike, the table to the left.",
                        "It's a small beige table with shoes on the lower shelf and three papers on top of it. One of the papers is mostly a reddish color, and two of the papers are upright.",
                        "It is the small table next to the curtains.",
                        "the small table next to the green curtain",
                        "This table is not in the kitchen area.",
                        "The smaller of the tables.",
                        "The table is close to the desk."
                    ]
                }
            },
            {
                "id": "48",
                "label": "tissue box",
                "position": [
                    -1.2502833355779996,
                    -3.3108926141925004,
                    0.7451875
                ],
                "size": [
                    0.4533248243479999,
                    0.35729805486499977,
                    0.412585
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/48-tissue box.obj",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The tissue box is a rectangular, cardboard box with a brown, smooth, and shiny finish. It has a wooden style design and contains a blue colored tissue. It is used for storing and dispensing toilet tissues."
                    ]
                }
            },
            {
                "id": "21",
                "label": "wall",
                "position": [
                    1.6686066245900002,
                    3.3924721486149996,
                    1.284354
                ],
                "size": [
                    3.109199069999998,
                    0.3406276600499991,
                    2.407832
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/21-wall.obj"
            },
            {
                "id": "49",
                "label": "nightstand",
                "position": [
                    -1.2985920177889998,
                    -3.287154618722,
                    0.40650955
                ],
                "size": [
                    0.4766950986780003,
                    0.3768156798639999,
                    0.8245948999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/49-nightstand.obj",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "Locate the sink below the mirror, facing the cabinet, and you'll find the nightstand to its left.",
                        "The nightstand, positioned conveniently near the trash can, serves as a practical and comfortable bedside table, providing ample space for essentials like a bedside lamp, book, and phone, while its close proximity to the backpack, cabinet, and bicycle ensures easy accessibility and a cohesive layout in the room.",
                        "Behind the stool and cabinet, a nightstand stands tall, within reach of the comforting couch, its drawers and shelves ready to store essentials and enhance the relaxing atmosphere."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the cabinet, The nightstand is to the left of the sink",
                        "Facing towards the backpack, behind the cabinet and bicycle is the nightstand , what's more, The nightstand is close to the trash can  .",
                        "Facing towards the backpack, behind the stool and cabinet and couch is the nightstand ."
                    ],
                    "obj_cap": [
                        "The nightstand is a white or black wooden furniture piece with two drawers and a shelf, used for storing items like lamps, laptops, and other bedside essentials. It has a simple and clean design, with a smooth texture and a rectangular or octagonal shape."
                    ],
                    "anno": [
                        "night stand to the right of the bed",
                        "If you face the bed, you need to select the nightstand that is on the right.",
                        "nightstand closer to the desk",
                        "The nightstand next to the desk with the office chair.",
                        "If you are looking at the bed from the living area, it is the nightstand on the right.",
                        "This nightstand is closest to the desk."
                    ]
                }
            },
            {
                "id": "10",
                "label": "sink",
                "position": [
                    3.0707519755499995,
                    -2.183290593155,
                    0.430145
                ],
                "size": [
                    0.4466896274199996,
                    0.6738708902100004,
                    0.90445
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/10-sink.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The sink, located beneath the mirror and situated between the trash can and refrigerator, serves as a convenient and accessible spot for washing dishes and hands, promoting cleanliness and hygiene in the kitchen.",
                        "The sink, located conveniently in front of the toilet and situated to the right of the nightstand and trash can, serves as a functional and comfortable spot for washing hands and other human activities."
                    ],
                    "template": [
                        "The sink is behind the trash can and refrigerator , it is also below mirror .",
                        "The sink is in front of the toilet , and The sink is to the right of the nightstand and trash can  ."
                    ],
                    "obj_cap": [
                        "The sink is a white, octagonal-shaped stainless steel sink used for washing dishes and hands. It has a smooth, shiny finish and a wooden structure with a mirror."
                    ]
                }
            },
            {
                "id": "31",
                "label": "stool",
                "position": [
                    1.3321503678650002,
                    2.6139441902249994,
                    0.411474
                ],
                "size": [
                    0.34388503275000026,
                    0.4595450365700007,
                    0.687964
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/31-stool.obj",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The stool can be found situated far to the right of the sink, facing towards the shoes, beneath the mirror.",
                        "The stool, located to the right of the shoes and in front of the trash can and bed, serves as a convenient perch for putting on or taking off footwear, and its sturdy design and comfortable cushioning make it an inviting spot to rest one's feet after a long day.",
                        "The stool, positioned behind another stool and in front of a trash can, serves as a convenient seat for someone accessing the cabinet, its comfortable design allowing for a relaxed experience while performing tasks."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the shoes, far to the right of the sink is the stool",
                        "The stool is to the right of the shoes , and The stool is in front of the trash can and bed  .",
                        "The stool is behind another stool  and is in front of trash can, also is to the right of cabinet ."
                    ],
                    "obj_cap": [
                        "The stool is a brown, oblong-shaped wooden stool with a smooth texture and a simple structure. It is commonly used in restaurants and kitchens as a seat or footrest."
                    ],
                    "anno": [
                        "2nd stool from the right",
                        "Second stool in from the window.",
                        "if looking at the wall from the fridge, it would be the 3rd stool in.",
                        "The bar stool second from the window.",
                        "The correct stool is second closest to the wall that has the window.",
                        "The second bar stool from the white wall",
                        "the third stool in starting at the edge of the kitchen bar."
                    ]
                }
            },
            {
                "id": "51",
                "label": "dish rack",
                "position": [
                    3.01872651285,
                    2.9701803654949996,
                    1.0562325000000001
                ],
                "size": [
                    0.4066773183999999,
                    0.6366589288300002,
                    0.4676150000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/51-dish rack.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The dish rack can be found beneath the kitchen cabinets, which are situated above the toaster oven.",
                        "The dish rack can be found beneath the kitchen cabinets, which are situated above the kitchen counter."
                    ],
                    "template": [
                        "The kitchen cabinets is above the toaster oven , and The dish rack is below the kitchen cabinets",
                        "The kitchen cabinets is above the kitchen counter , and The dish rack is below the kitchen cabinets"
                    ],
                    "obj_cap": [
                        "The dish rack is a white, triangular-shaped basket made of stainless steel, used for storing utensils, dishes, pots, and pans in the kitchen. It has a smooth texture and is made of a metal frame and stainless steel."
                    ]
                }
            },
            {
                "id": "38",
                "label": "cabinet",
                "position": [
                    3.1108913468750004,
                    -0.9804185963500005,
                    1.1786149
                ],
                "size": [
                    0.3971318604699974,
                    1.0415520383599994,
                    2.3713502
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/38-cabinet.obj",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "The cabinet is situated to the right of the sink, which is directly below the mirror and faces the table.",
                        "Behind the guitar case, a cabinet blends seamlessly into the space, its sleek design and functionality complementing the surrounding objects, while its proximity to the shoes and second cabinet creates a sense of harmony and accessibility.",
                        "The cabinet, which stores various household items, is situated to the right of the comfortable couch and bicycle, and its front facade faces the direction of the convenient toilet, inviting easy access and use by inhabitants of the room."
                    ],
                    "template": [
                        "The sink is below the mirror , and Directly facing the table, The cabinet is close to the right of the sink",
                        "The cabinet is behind the guitar case , and The cabinet is to the right of the cabinet and shoes  .",
                        "The cabinet is to the right of the couch and bicycle , it is also in front of toilet ."
                    ],
                    "obj_cap": [
                        "The cabinet is a wooden storage cabinet with two doors and a drawer, featuring an octagonal shape and a brown color. It has a wooden texture and a tall structure, ideal for kitchen or storage use."
                    ],
                    "anno": [
                        "the cabinet to the right of the white door",
                        "Choose the full height set of cabinets by the door next to the fridge.",
                        "The set of cabinets that is on the right ride of the white door, on the same side of the room as trash can and refrigerator",
                        "The pantry cabinet that is on the wall between the door and the bathroom",
                        "The tall vertical cabinet beside the door",
                        "the tall cabinet to the left of the open bathroom door",
                        "THe tall cabinets that are directly between the main door and bathroom door and nearest to the garbage cans"
                    ]
                }
            },
            {
                "id": "44",
                "label": "object",
                "position": [
                    1.1284191362799998,
                    -2.217205272955,
                    0.5464072000000001
                ],
                "size": [
                    0.6371147868999998,
                    0.6853787214099998,
                    1.1735056000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/44-object.obj",
                "caption": {
                    "obj_cap": [
                        "A black, plastic knife with a smooth texture and a spherical shape, used for cutting food."
                    ]
                }
            },
            {
                "id": "16",
                "label": "pillow",
                "position": [
                    -0.300817681454999,
                    -3.27178493265,
                    0.9429175
                ],
                "size": [
                    0.9177830440100001,
                    0.4306575132399999,
                    0.40354500000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/16-pillow.obj",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The pillow is a brown, furry pillow in the shape of a bear's head, stuffed with fur and can be used as a headrest or blanket. It has a soft texture and is made of fur or leather."
                    ]
                }
            },
            {
                "id": "14",
                "label": "trash can",
                "position": [
                    -1.572693090025,
                    -2.9844254542395,
                    0.12791324999999998
                ],
                "size": [
                    0.24538909507000017,
                    0.4964898350989997,
                    0.2723055
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/14-trash can.obj",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "As you face the cabinet, your gaze falls upon the sink, positioned below the mirror, and to its left, you'll find the trash can, nestled a short distance away.",
                        "The trash can, conveniently located near the shower and refrigerator, is a vital component of the bathroom's waste management system, allowing for easy disposal of used toiletries and other bathroom waste, promoting a clean and hygienic environment for all users.",
                        "The trash can, positioned behind the bicycle and to the left of the laundry basket, stands ready to receive discarded items, its functional design and comfortable accessibility facilitating the efficient disposal of waste."
                    ],
                    "template": [
                        "The sink is below the mirror , while Facing the cabinet, The trash can is far to the left of the sink",
                        "Directly facing the backpack, The trash can is to the left of the shower and trash can and refrigerator .",
                        "Directly facing the backpack, The trash can is behind the bicycle , and The trash can is to the left of the trash can and laundry basket  ."
                    ],
                    "obj_cap": [
                        "The trash can is a white, plastic, oblong-shaped container with a rectangular base and a lid. It is used for storing and disposing of trash. The texture is smooth and white, and the structure is a plastic body with a square shape."
                    ],
                    "anno": [
                        "The trash can closest to the bed.",
                        "The can that is next to the bed.",
                        "The trashcan beside the bed.",
                        "trash can near the bed.",
                        "The trash can to the right of the bed",
                        "Find the trash can that is in between the bed and desk."
                    ]
                }
            },
            {
                "id": "5",
                "label": "curtain",
                "position": [
                    -3.31145063369,
                    -0.01335030144300009,
                    1.07121885
                ],
                "size": [
                    0.4408227383400001,
                    3.858156298834,
                    2.1603422999999995
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/5-curtain.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The curtain is a green, triangular-shaped piece of taffeta material used to cover a bicycle. It has a smooth texture and a pattern on it. It is a curtain with a structured shape and is used to keep a bike out of the room."
                    ],
                    "anno": [
                        "the large green curtains",
                        "Its the long green curtain with a bike parked in front of it.",
                        "bigger curtain with the bike next to it",
                        "It is the large green curtains behind the bike.",
                        "It is the large set of curtains behind the bike.",
                        "the bigger curtain near bike"
                    ]
                }
            },
            {
                "id": "15",
                "label": "tv",
                "position": [
                    -2.8320449772364995,
                    2.4528891143139995,
                    1.016639
                ],
                "size": [
                    0.8353918778690002,
                    0.9981406265400006,
                    0.4475220000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/15-tv.obj",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The TV is a flat screen television with a black screen and a sleek, modern design made of plexiglass or glass. It is used to watch TV and has a flat, smooth texture. The structure of the TV is a flat screen with a black border, giving it a stylish and minimalist look."
                    ]
                }
            },
            {
                "id": "0",
                "label": "window",
                "position": [
                    1.4812942290650004,
                    3.5207407571900005,
                    1.8565299999999998
                ],
                "size": [
                    1.7444573214100005,
                    0.23196063007999967,
                    0.5723599999999995
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/0-window.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "A large, brown, wooden double-hung window with a view of the ocean, frosted glass, and a 3D octagon shape."
                    ],
                    "anno": [
                        "The windows in the kitchen.",
                        "The set of three windows that are in the kitchen area, above a long thin white counter.",
                        "Choose the three paned windows over the skinny bar separatinhg the kitchen and living room.",
                        "This is a set of three windows high up in the kitchen.",
                        "The window is above the bar and stools.",
                        "Triple window in the kitchen",
                        "The window not in the bathroom."
                    ]
                }
            },
            {
                "id": "2",
                "label": "table",
                "position": [
                    1.1465533200800007,
                    2.1986666265699997,
                    0.61649375
                ],
                "size": [
                    0.5418415355999997,
                    2.53462912262,
                    1.2144725
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/2-table.obj",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "Locate the sink below the mirror, then gaze directly facing the table; you'll find it far to the right of the sink.",
                        "The floor-placed table, partially obscured by a stool and positioned to the left of a nearby cabinet, serves as a versatile surface for various human activities, offering a comfortable and functional space for working, dining, or socializing."
                    ],
                    "template": [
                        "The sink is below the mirror , while Directly facing the table, The table is far to the right of the sink",
                        "The table is placed on the floor  and is behind stool, also is to the left of cabinet ."
                    ],
                    "obj_cap": [
                        "White, wooden table with octagonal shape and triangle legs, used as dining, bar, or coffee table, has a smooth wood texture and is made of wood, with stools or chairs accompanying it."
                    ],
                    "anno": [
                        "the table is near the fridge",
                        "The table closest to the doors.",
                        "The table closest to the couch.",
                        "the tall table with the stools underneath",
                        "It is the table in the kitchen closest to the fridge and backing against part of the sectional sofa.",
                        "The table across from the fridge."
                    ]
                }
            },
            {
                "id": "42",
                "label": "cabinet",
                "position": [
                    2.65273834624,
                    2.5016468292500003,
                    0.487982
                ],
                "size": [
                    0.10734404364000039,
                    1.8441743930800012,
                    0.887268
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/42-cabinet.obj",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "The cabinet is situated to the right of the sink, which is positioned below the mirror, creating a linear layout with the table directly facing the sink.",
                        "The cabinet, located adjacent to the shelf and stool, stands proudly in front of the sink, its doors and drawers awaiting the user's touch, ready to reveal the treasures within, while providing a comfortable and accessible storage solution for the busy chef.",
                        "The cabinet, which serves as a convenient storage space for office supplies, is located to the right of the backpack and bicycle, and is easily accessible while working at the desk."
                    ],
                    "template": [
                        "below the mirror is the sink , while Directly facing the table, The cabinet is far to the right of the sink",
                        "The cabinet is to the right of the shelf and stool , it is also in front of sink .",
                        "in front of the desk is the cabinet , and The cabinet is to the right of the backpack and bicycle  ."
                    ],
                    "obj_cap": [
                        "Brown, octagonal, wooden kitchen cabinet with a microwave compartment."
                    ],
                    "anno": [
                        "The cabinet directly underneath the microwave, next to the fridge.",
                        "Find the cabinet to the left of the refrigerator.",
                        "choose the cabinet nearest to the fridge",
                        "This cabinet is closest to the refrigerator",
                        "the cabinet with the counter and sink on it",
                        "cabinet with white counter top to the left of the refrigerator.",
                        "The correct cabinet is a kitchen cabinet with a white counter top."
                    ]
                }
            },
            {
                "id": "20",
                "label": "wall",
                "position": [
                    -3.45718600945,
                    -0.33452572337861985,
                    1.4507565
                ],
                "size": [
                    0.3573174105599999,
                    6.425944322427321,
                    2.742867
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/20-wall.obj"
            },
            {
                "id": "13",
                "label": "trash can",
                "position": [
                    2.993944377830001,
                    0.6052486612899994,
                    0.3332889
                ],
                "size": [
                    0.45761458526,
                    0.4152574557200004,
                    0.6463322
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/13-trash can.obj",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The trash can is located to the right of the sink, positioned at a distance, and can be seen when facing the backpack.",
                        "The trash can, positioned conveniently in front of the toilet and to the right of the guitar case and shoes, is an essential element in maintaining a clean and hygienic environment in the bathroom.",
                        "The trash can, positioned conveniently near the sink and toilet for efficient waste disposal, stands proudly in its designated spot to the right of the table, eager to serve its purpose in this well-organized bathroom."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the backpack, The trash can is far to the right of the sink",
                        "Facing towards the cabinet, The trash can is in front of the toilet , and The trash can is to the right of the guitar case and shoes  .",
                        "Directly facing the cabinet, The trash can is to the right of the table , and The trash can is in front of the sink and toilet  ."
                    ],
                    "obj_cap": [
                        "The trash can is a white, plastic, spherical or octagonal shaped container with a smooth texture and a lid. It can be used in a bathroom or kitchen and is made of plastic."
                    ],
                    "anno": [
                        "Choose the tall white trash can by the door.",
                        "the trash can is closest to the white kitchen",
                        "the large garbage can next to the fridge",
                        "The tall trash can beside the door.",
                        "Pick the larger trash can that is next to the refridgerator.",
                        "I am the taller trash can behind the smaller one"
                    ]
                }
            },
            {
                "id": "34",
                "label": "coffee table",
                "position": [
                    -0.8569325393,
                    2.13488842917,
                    0.22876280000000002
                ],
                "size": [
                    1.1151766403,
                    0.6675509609999999,
                    0.4845784
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/34-coffee table.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The coffee table is situated to the right of the sink, adjacent to the bicycle.",
                        "The table, situated between the cabinet and the coffee table, occupies the center position.",
                        "The coffee table, situated to the left of the stool and in front of the sink and bed, serves as a convenient surface for placing drinks or snacks while providing a comfortable spot to rest one's feet, its sleek design complementing the modern aesthetic of the room.",
                        "The coffee table, located in the vicinity of the cabinet and refrigerator, serves as a convenient surface for placing drinks and snacks, and its proximity to the toilet makes it an ideal spot for guests to relax and socialize while taking a break from their daily routines."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the bicycle, The coffee table is far to the right of the sink",
                        "The coffee table is placed in the middle of cabinet and the table.",
                        "Facing the shelf, The coffee table is to the left of the stool , and The coffee table is in front of the sink and bed  .",
                        "Facing towards the shelf, The coffee table is to the left of the cabinet and refrigerator , it is also in front of toilet ."
                    ],
                    "obj_cap": [
                        "The coffee table is a rectangular, dark blue leather ottoman with a flat surface and a storage compartment underneath. It has a wooden structure and can be used as a footstool or a remote control table. The texture is leather and the style is modern and minimalist."
                    ]
                }
            },
            {
                "id": "41",
                "label": "cabinet",
                "position": [
                    0.9344172797350003,
                    -3.1619837207600003,
                    1.861125
                ],
                "size": [
                    0.35880405968999973,
                    0.7128895215799997,
                    0.9009499999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/41-cabinet.obj",
                "count": 5,
                "caption": {
                    "obj_cap": [
                        "This cabinet is a brown, wooden, corner cabinet with a triangular shape and a crown molding. It has a wood grain texture and is used for storing kitchen items."
                    ],
                    "anno": [
                        "Facing the fridge, the cabineti n the top right corner.",
                        "The cabinet is the one on the wall above the blue bed.",
                        "cabinet to the left of the blue bed.",
                        "Face yourself towards the blue bed.  The cabinet you want to pick is the one to the left of the bed, closest to the bed.",
                        "The brown cabinet on the wall to the left of the bed.",
                        "cabinet on the wall just above the blue bed on the left side."
                    ]
                }
            },
            {
                "id": "37",
                "label": "bed",
                "position": [
                    -0.3014765729949995,
                    -2.4772575786580004,
                    0.40104629999999997
                ],
                "size": [
                    1.560201317969999,
                    1.9943358953360002,
                    0.8338534
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/37-bed.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "As you face the coffee table, the bed is situated to the left of the sink, at a noticeable distance.",
                        "The bed, positioned behind the table and cabinet, lies to the left of the laundry basket, creating a cozy atmosphere for rest and relaxation.",
                        "The bed, located behind the stool, table, and refrigerator, offers a comfortable sleeping surface for restful nights, while the shelf in front provides ample storage space for bedtime essentials."
                    ],
                    "template": [
                        "The sink is below the mirror , while Facing towards the coffee table, The bed is far to the left of the sink",
                        "Directly facing the shelf, The bed is behind the table and cabinet , it is also to the left of laundry basket .",
                        "Standing in front of the shelf, The bed is behind the stool and table and refrigerator ."
                    ],
                    "obj_cap": [
                        "The bed is a queen size bed made of wood, with a soft texture and a rectangular shape. It has a headboard and footboard, and is on wheels, making it easy to move around. It is designed for guests and can also be used as a travel bed."
                    ]
                }
            },
            {
                "id": "36",
                "label": "toilet",
                "position": [
                    2.960582830180001,
                    -3.066446446165,
                    0.35337189999999996
                ],
                "size": [
                    0.7010967141200002,
                    0.5723007393299997,
                    0.7430862
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/36-toilet.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "As you stand in front of the mirror, the sink is situated directly below, and if you turn left, you'll find the toilet just a few steps away.",
                        "The toilet, located adjacent to the sink and concealed by a cabinet and stool, boasts a functional design and comfortable seating, making it an ideal spot for personal hygiene routines.",
                        "The toilet, located adjacent to the sink and situated behind the stool and guitar case, boasts a comfortable and functional design, perfect for use by humans in this scenario."
                    ],
                    "template": [
                        "The sink is below the mirror , while Directly facing the bed, The toilet is close to the left of the sink",
                        "Directly facing the sink, The toilet is behind the cabinet and stool , it is also to the right of shower .",
                        "Facing the sink, behind the stool and guitar case is the toilet , what's more, The toilet is to the right of the desk  ."
                    ],
                    "obj_cap": [
                        "The toilet is a white, oblong-shaped object made of wood with a smooth, shiny finish. It has a seat and is used for urination and toilet paper. It has a white, porcelain appearance and is a standard toilet design."
                    ]
                }
            },
            {
                "id": "4",
                "label": "shower",
                "position": [
                    1.5956711702100006,
                    -2.8972787094000005,
                    0.8784968
                ],
                "size": [
                    0.9418286461200003,
                    1.1830437837599996,
                    1.8209064000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/4-shower.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "As you face the coffee table, the shower is situated to the left of the sink, which is directly below the mirror.",
                        "The toilet is situated adjacent to the bed, with the shower located in the midst of this cozy arrangement.",
                        "The shower, positioned adjacent to the laundry basket and desk, is located east of the trash can, providing a refreshing experience for those who seek it."
                    ],
                    "template": [
                        "The sink is below the mirror , while Standing in front of the coffee table, The shower is close to the left of the sink",
                        "The shower is in the middle of bed and the toilet.",
                        "Facing the stool, The shower is to the right of the laundry basket and desk , it is also behind trash can ."
                    ],
                    "obj_cap": [
                        "The shower is a walk-in shower with a glass door, made of glass material, and has a smooth texture. It is designed with a corner shape and has a modern style."
                    ]
                }
            },
            {
                "id": "3",
                "label": "kitchen counter",
                "position": [
                    2.9168140869550006,
                    2.50163738435,
                    0.9722355
                ],
                "size": [
                    0.6169841735500006,
                    1.8428017827999996,
                    0.28696900000000003
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/3-kitchen counter.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The kitchen counter lies beneath the microwave, which sits atop the toaster oven.",
                        "To locate the kitchen counter from the dish rack, look for the surface that is lower than the kitchen cabinets but higher than the dish rack.",
                        "The kitchen counter, positioned at a comfortable height for food preparation and equipped with storage space beneath for easy access to utensils, is mounted on the wall, its sleek surface reflecting the warm lighting of the surrounding cabinets and microwave, creating a cozy and inviting atmosphere for culinary creativity.",
                        "The kitchen counter, situated below the kitchen cabinets and microwave, serves as a convenient workspace and food preparation area, while its wall-mounted design provides ample legroom and a comfortable environment for culinary activities."
                    ],
                    "template": [
                        "The microwave is higher than the toaster oven , and The kitchen counter is lower than the microwave",
                        "The kitchen cabinets is higher than the dish rack , while The kitchen counter is lower than the kitchen cabinets",
                        "The kitchen counter is hung on the wall , and The kitchen counter is lower than the kitchen cabinets and microwave  .",
                        "lower than the kitchen cabinets and microwave is the kitchen counter , it is also hung on wall ."
                    ],
                    "obj_cap": [
                        "The kitchen counter is a white, wooden rectangular or octagonal surface used for food preparation, storage, and appliance placement, with a sink, microwave, toaster, and refrigerator. It has a smooth wood texture and is made of wood."
                    ]
                }
            },
            {
                "id": "46",
                "label": "laundry basket",
                "position": [
                    0.8044312081800005,
                    -2.7393385708100007,
                    0.23839345
                ],
                "size": [
                    0.42885920199999994,
                    0.5148200694799998,
                    0.5444551
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/46-laundry basket.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Locate the sink beneath the mirror, then gaze leftwards to spot the laundry basket, nestled far to the left of the sink, near the table.",
                        "Between the bed and shower lies a convenient laundry basket, ready to hold your dirty clothes.",
                        "The laundry basket, positioned conveniently to the right of the cabinet and trash can, is a comfortable and functional addition to the room, allowing for easy sorting and storage of dirty clothes.",
                        "The laundry basket, positioned behind the coffee table, guitar case, and trash can, serves as a convenient repository for dirty clothes, within easy reach of the stool, enhancing the functionality and comfort level of the space."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the table, The laundry basket is far to the left of the sink",
                        "In the middle of bed and the shower is a laundry basket.",
                        "Standing in front of the stool, to the left of the sink is the laundry basket , and The laundry basket is to the right of the cabinet and trash can  .",
                        "Directly facing the stool, The laundry basket is behind the coffee table and guitar case and trash can ."
                    ],
                    "obj_cap": [
                        "The laundry basket is a plastic basket with a blue, purple, and black color scheme. It has a triangular shape and is made of plastic. It is used for carrying and storing laundry, and has a smooth texture. The structure of the basket is a mesh design, allowing for airflow and visibility of the clothes inside."
                    ]
                }
            },
            {
                "id": "22",
                "label": "wall",
                "position": [
                    1.4074444766300003,
                    -2.0768932099200006,
                    0.75429215
                ],
                "size": [
                    0.5772111123399988,
                    1.04924581186,
                    1.5552757
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/22-wall.obj"
            },
            {
                "id": "32",
                "label": "couch",
                "position": [
                    -0.39350335696499994,
                    1.6013823241049994,
                    0.4361819
                ],
                "size": [
                    2.8234230013099997,
                    2.31576921893,
                    0.9160082
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/32-couch.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The couch is situated to the right of the sink, which is located below the mirror, and can be seen when facing towards the shoes.",
                        "The bicycle and stool flank a couch that seems misplaced.",
                        "The bicycle and stool are positioned on either side of the couch, creating a unique and quirky layout in the room.",
                        "The bed and shelf flank the couch, which sits regally in the middle.",
                        "The plush couch, with its soft cushions and inviting texture, is strategically positioned to the left of the stool, creating a cozy seating area that's perfect for lounging while strumming a tune on the guitar, which lies adjacent to the couch, within easy reach of the nightstand that supports a reading lamp, providing ample light for a relaxing evening in."
                    ],
                    "template": [
                        "The sink is below the mirror , while Facing towards the shoes, The couch is far to the right of the sink",
                        "It is a couch in the middle of stool and the bicycle.",
                        "The couch is in the middle of bicycle and the stool.",
                        "The couch is located in the middle of shelf and the bed.",
                        "The couch is to the left of the stool  and is in front of nightstand, also is adjacent to guitar case ."
                    ],
                    "obj_cap": [
                        "Blue sectional couch with a velvet texture and octagonal shape, suitable for a living room setting."
                    ]
                }
            },
            {
                "id": "50",
                "label": "nightstand",
                "position": [
                    0.7825843958200003,
                    -3.2361145319750007,
                    0.391141
                ],
                "size": [
                    0.48006438707999965,
                    0.4081755260299995,
                    0.489286
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/50-nightstand.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The nightstand is a white, wooden octagon with two drawers and a shelf, used as a bedside table. It has a smooth white surface and a lamp on top."
                    ],
                    "anno": [
                        "The nightstand that is on the side of the bed closest to the bathroom.",
                        "facing the bed, nightstand to the left",
                        "The nightstand to the left of the bed",
                        "The nightstand next to the blue backpack."
                    ]
                }
            },
            {
                "id": "61",
                "label": "object",
                "position": [
                    -0.7730640462250005,
                    -1.7253421018800004,
                    0.818742
                ],
                "size": [
                    0.2812835191899996,
                    0.25575492450000015,
                    0.12422
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/61-object.obj",
                "caption": {
                    "obj_cap": [
                        "The object is a white plastic cat toy with a spherical shape and smooth texture. It has a ring attached to its head, which can be used as a mirror or a pendant. The cat toy can also be used as a mask or a water bottle."
                    ]
                }
            },
            {
                "id": "53",
                "label": "toaster",
                "position": [
                    3.1374437071950005,
                    2.37749743257,
                    1.024565
                ],
                "size": [
                    0.19641791644999884,
                    0.2721047254000011,
                    0.16920999999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/53-toaster.obj",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The toaster is a white, oblong-shaped device made of stainless steel, used for toasting bread. It has a shiny and smooth texture and a simple, compact structure."
                    ]
                }
            },
            {
                "id": "60",
                "label": "object",
                "position": [
                    0.8406784736050001,
                    -2.8445678065,
                    1.25867
                ],
                "size": [
                    0.42749308247000073,
                    0.33655543366000007,
                    0.29410000000000003
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/60-object.obj",
                "caption": {
                    "obj_cap": [
                        "The object is a black leather bag with the word Coleman on it, likely used as a sleeping bag or toiletry bag. It has a spherical shape, smooth texture, and a structured design with a handle and a label."
                    ]
                }
            },
            {
                "id": "11",
                "label": "scale",
                "position": [
                    1.4538435142200004,
                    -1.999792959105,
                    0.0023918999999999954
                ],
                "size": [
                    0.43647121434,
                    0.4180710976499993,
                    0.0445706
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/11-scale.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Locate the sink beneath the mirror, then glance towards the shower; the scale awaits your attention, positioned to the right of the sink.",
                        "Behind the shelf and couch, a scale is located, unobtrusively blending into the room's layout, allowing for easy access and use.",
                        "The scale, positioned behind the shelf and table, and to the left of the cabinet, is easily accessible and within comfortable reach, allowing for efficient weighing of objects, and its functional design blends seamlessly into the surrounding environment, facilitating various human activities."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the shower, The scale is far to the right of the sink",
                        "Facing the stool, The scale is behind the shelf and couch and coffee table .",
                        "Directly facing the stool, The scale is behind the shelf and table , it is also to the left of cabinet ."
                    ],
                    "obj_cap": [
                        "The scale is a digital, beige and white tetrahedron with a smooth, shiny surface. It is made of stainless steel and beryllium-titanium alloy, and it measures weight and thickness. It has a smooth, shiny texture and a triangle structure. It is used in the bathroom to measure weight."
                    ]
                }
            },
            {
                "id": "43",
                "label": "kitchen cabinets",
                "position": [
                    2.9524475234649996,
                    2.563536231314999,
                    1.8823050000000001
                ],
                "size": [
                    0.26661914539000087,
                    1.69096730415,
                    1.0525099999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/43-kitchen cabinets.obj",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "The kitchen cabinets can be found above the toaster oven, which is situated below the microwave."
                    ],
                    "template": [
                        "The toaster oven is lower than the microwave , while The kitchen cabinets is above the toaster oven"
                    ],
                    "obj_cap": [
                        "The kitchen cabinets are made of wood, have a dark brown color, and an octagonal shape. They are used for storage in the kitchen and have a wood grain texture."
                    ],
                    "anno": [
                        "The kitchen cabinets next to the microwave but not above the fridge.  There is a paper towel holder attached.  They appear to be 30 x 36.",
                        "upper cabinets on your left of the cooker",
                        "The larger cabinet in the corner",
                        "The cabinet above the sink full of dishes",
                        "The cabinet not under the refrigerator.",
                        "The larger kitchen cabinet on the left, when facing the cabinets from the couch.",
                        "The upper kitchen cabinets that is to the left of the microwave and is against the wall"
                    ]
                }
            },
            {
                "id": "6",
                "label": "curtain",
                "position": [
                    -2.0134828109029996,
                    -3.485741549317,
                    1.57681
                ],
                "size": [
                    1.9911499475739998,
                    0.216033415264,
                    1.2766599999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/6-curtain.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The curtain is a beige, brown, or white rectangular sheer curtain made of tan material, used to cover a bed or window in a bedroom, with a smooth texture and a simple curtain structure."
                    ],
                    "anno": [
                        "curtains hanging on a big window",
                        "The curtains that are above the desk.",
                        "The curtains above the bed",
                        "the curtains on the wall behind the sofa",
                        "The shorter curtains that are above a desk and on the same wall with the bed.",
                        "The curtains next to the bed.",
                        "The curtains on the window next to the bed.",
                        "It is the smaller set of curtains over the desk near the bed."
                    ]
                }
            },
            {
                "id": "47",
                "label": "guitar",
                "position": [
                    1.1575503098550008,
                    -1.5480944441900006,
                    0.5263396
                ],
                "size": [
                    0.48943827022999997,
                    0.46636892809999986,
                    0.9959008000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/47-guitar.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Locate the sink below the mirror, and then look to the right of it; you'll find the guitar next to the laundry basket.",
                        "The guitar, positioned on a stool, is nestled between the laundry basket and the desk, with the shelf serving as a backdrop, creating a cozy and functional space for musical exploration.",
                        "The guitar, positioned behind the table and to the right of the bicycle and trash can, stands proudly on its designated stool, awaiting the gentle strumming of a musician's fingers to bring forth its rich, melodic tones."
                    ],
                    "template": [
                        "The sink is below the mirror , while Facing the laundry basket, The guitar is far to the right of the sink",
                        "Standing in front of the stool, The guitar is in front of the laundry basket  and is to the right of desk, also is behind shelf .",
                        "Standing in front of the stool, The guitar is to the right of the bicycle and trash can , it is also behind table ."
                    ],
                    "obj_cap": [
                        "Brown acoustic guitar with a 3D shape, made of wood, used for acoustic music, has a smooth texture and a typical acoustic guitar structure."
                    ]
                }
            },
            {
                "id": "19",
                "label": "wall",
                "position": [
                    -1.1771848944860004,
                    -3.3485953119325003,
                    1.207546925
                ],
                "size": [
                    4.461825120052,
                    0.5272211712550003,
                    2.52956615
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/19-wall.obj"
            },
            {
                "id": "30",
                "label": "stool",
                "position": [
                    1.3572022911350001,
                    3.135159383695,
                    0.417297
                ],
                "size": [
                    0.33590316700999967,
                    0.4801895607500004,
                    0.6919959999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/30-stool.obj",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The stool is situated to the right of the sink, which is positioned below the mirror and faces the couch.",
                        "The stool is strategically positioned near the table, serving as a convenient seat for individuals using the table, and its proximity to the trash can and bed ensures easy accessibility for efficient waste disposal and comfortable sleep."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the couch, The stool is far to the right of the sink",
                        "The stool is next to the table , and The stool is in front of the trash can and bed  ."
                    ],
                    "obj_cap": [
                        "The stool is a wooden kitchen stool with an octagonal shape, brown in color, and a smooth wooden texture. It can be used as a bedside table or a kitchen stool."
                    ],
                    "anno": [
                        "Stool nearest kitchen window",
                        "Facing the stools, the stool closest to the wall.",
                        "Stool under the bar closest to the windows",
                        "stool closest to the wall",
                        "The last stool at the end closest to the wall in the kitchen",
                        "The correct stool is the one closest to the wall and window.",
                        "The correct stool is the one closest to the wall and window."
                    ]
                }
            },
            {
                "id": "12",
                "label": "trash can",
                "position": [
                    2.7251812977400003,
                    0.6345295629349996,
                    0.18862615
                ],
                "size": [
                    0.3737528549600002,
                    0.3671248844299999,
                    0.3852677
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/12-trash can.obj",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "Locate the sink beneath the mirror, then face towards the backpack; the trash can is situated to the far right of the sink.",
                        "The trash can, conveniently located behind the guitar case and to the right of the coffee table and stool, is a functional and comfortable addition to the room, allowing for easy disposal of waste and enhancing the overall cleanliness of the space.",
                        "The trash can, located behind the stool and to the right of the table and backpack, is easily accessible and convenient for disposing of waste, and its sleek design blends seamlessly into the surrounding environment, providing a comfortable and functional space for human activity."
                    ],
                    "template": [
                        "The sink is below the mirror , while Facing towards the backpack, The trash can is far to the right of the sink",
                        "Directly facing the cabinet, The trash can is behind the guitar case , and The trash can is to the right of the coffee table and stool  .",
                        "Directly facing the cabinet, The trash can is behind the stool , and The trash can is to the right of the table and backpack  ."
                    ],
                    "obj_cap": [
                        "The trash can is a white plastic container with a spherical shape, a lid, and a handle. It can be used for various purposes such as a laundry basket, a planter, or a trash can. It has a smooth texture and is made of plastic."
                    ],
                    "anno": [
                        "the trash can is the small one next to the fridge",
                        "Next to the fridge there are two trash cans. Pick the trash can that is smailler.",
                        "the smaller trashcan next to the white door",
                        "the smaller white trashcan",
                        "The SMALLER trashcan near the door",
                        "The smaller trash can that is in front of another trash can",
                        "smaller trash can bear the door"
                    ]
                }
            },
            {
                "id": "63",
                "label": "doorframe",
                "position": [
                    2.12450487814,
                    -1.5792578619350004,
                    0.9844176500000001
                ],
                "size": [
                    1.0155532276000008,
                    0.22370755886999927,
                    1.9967247000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/63-doorframe.obj",
                "caption": {
                    "obj_cap": [
                        "The doorframe is a wooden frame with a mirror on it, octagonal in shape, made of wood, and has a smooth texture. It can be used as a mirror or as a doorframe for a bathroom or toilet."
                    ]
                }
            },
            {
                "id": "33",
                "label": "refrigerator",
                "position": [
                    2.79179937121,
                    1.2886699234299999,
                    0.9119664000000001
                ],
                "size": [
                    0.9366132709999997,
                    1.2307717231599997,
                    1.8127672000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/33-refrigerator.obj",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The refrigerator is located to the right of the sink, which is situated below the mirror and facing the couch.",
                        "The trash can is positioned adjacent to the cabinet, with the refrigerator situated between them.",
                        "The refrigerator, located on the top of the floor and to the right of the cabinet, serves as a convenient storage space for perishable items and is easily accessible from the nearby stool.",
                        "The refrigerator, located conveniently to the right of the shoes and elevated on the top of the floor, stands proudly in front of the toilet, efficiently serving its purpose as a trusty cooling companion for the household's food and beverage needs, while also providing a comfortable and accessible experience for the human inhabitants of the space."
                    ],
                    "template": [
                        "The sink is below the mirror , and Facing towards the couch, The refrigerator is far to the right of the sink",
                        "The refrigerator is between cabinet and the trash can.",
                        "The refrigerator is on the top of the floor  and is to the right of cabinet, also is behind stool .",
                        "The refrigerator is to the right of the shoes  and is on the top of floor, also is in front of toilet ."
                    ],
                    "obj_cap": [
                        "The refrigerator is a white, oblong-shaped appliance made of stainless steel and white materials. It has a smooth, white texture and a structure that is compact and modern. It is used to store food and drinks, keeping them fresh and cool."
                    ]
                }
            },
            {
                "id": "1",
                "label": "window",
                "position": [
                    2.9039556841700005,
                    -3.4803392577300007,
                    1.526825
                ],
                "size": [
                    0.6607808123400005,
                    0.1707291127599997,
                    0.6715300000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/obj/1-window.obj",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "A white, octagon-shaped window with a frosted glass texture and a double-hung structure, allowing natural light to enter and providing a view of the outside world."
                    ],
                    "anno": [
                        "This window is in the bathroom alongside the toilet.",
                        "The window in the bathroom next to the toilet",
                        "The window inside the bathroom",
                        "Find the smaller window that is in the bathroom.",
                        "The window above the toilet",
                        "The window in the bathroom.",
                        "This is a single window with a white chair beneath it, in a small corner room."
                    ]
                }
            }
        ],
        "inst_to_label": {
            "0": "window",
            "1": "window",
            "2": "table",
            "3": "kitchen counter",
            "4": "shower",
            "5": "curtain",
            "6": "curtain",
            "7": "desk",
            "8": "cabinet",
            "9": "floor",
            "10": "sink",
            "11": "scale",
            "12": "trash can",
            "13": "trash can",
            "14": "trash can",
            "15": "tv",
            "16": "pillow",
            "17": "clock",
            "18": "backpack",
            "19": "wall",
            "20": "wall",
            "21": "wall",
            "22": "wall",
            "23": "wall",
            "24": "wall",
            "25": "wall",
            "26": "wall",
            "27": "wall",
            "28": "stool",
            "29": "stool",
            "30": "stool",
            "31": "stool",
            "32": "couch",
            "33": "refrigerator",
            "34": "coffee table",
            "35": "table",
            "36": "toilet",
            "37": "bed",
            "38": "cabinet",
            "39": "cabinet",
            "40": "kitchen cabinets",
            "41": "cabinet",
            "42": "cabinet",
            "43": "kitchen cabinets",
            "44": "object",
            "45": "toaster oven",
            "46": "laundry basket",
            "47": "guitar",
            "48": "tissue box",
            "49": "nightstand",
            "50": "nightstand",
            "51": "dish rack",
            "52": "microwave",
            "53": "toaster",
            "54": "door",
            "55": "ceiling",
            "56": "shelf",
            "57": "bicycle",
            "58": "shoes",
            "59": "object",
            "60": "object",
            "61": "object",
            "62": "object",
            "63": "doorframe",
            "64": "mirror",
            "65": "doorframe",
            "66": "guitar case"
        },
        "mesh_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/scene0000_00_vh_clean_2.ply",
        "seg_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/scannet/scans/scene0000_00/scene0000_00_vh_clean_2.labels.ply",
        "align_mat": 0,
        "scene_cap": [
            "In this apartment scene, there are various objects that contribute to its functionality and style. The room contains 4 stools, 2 kitchen cabinets, 2 windows, 2 curtains, 1 kitchen counter, 1 shower, and 1 sink. The sink is positioned to the right of the shower, while the shower is located near the sink in the 8 o'clock direction. The kitchen counter is placed lower than the kitchen cabinets, which are positioned above it. One of the stools is placed 11 o'clock direction far from the sink, while another stool is placed 12 o'clock direction near it. Additionally, there is a stool placed 12 o'clock direction far from the shower. The arrangement of these objects suggests a functional and organized apartment, with the stools providing seating options and the kitchen cabinets offering storage space. The presence of a shower and sink indicates that the apartment is equipped with bathroom facilities. Overall, the scene depicts a comfortable living space with a well-designed layout.",
            "In this Apartment, the floor is supported by the stool, while the nightstand rests on the floor. There are two nightstands, one of which is positioned far from the stool in the 6 o'clock direction. The Apartment also contains two kitchen cabinets, a clock, two curtains, and two doorframes. With its 9 walls, the Apartment exudes a sense of structure and enclosure. The presence of multiple stools suggests a functional and comfortable space, perhaps for socializing or dining. The overall style and comfort level of the Apartment can be inferred from the arrangement and count of objects within the room.",
            "In this Apartment, two kitchen cabinets stand tall, exuding an air of functionality and organization. A single clock adorns the wall, its hands ticking away the moments of time. The walls, numbering nine, enclose the space, providing a sense of security and privacy. Two tables, perhaps serving as gathering places for meals or work, occupy the room. The arrangement of objects suggests a room designed for culinary pursuits and communal activities. The Apartment, with its ample storage, punctual timepiece, and ample surfaces, offers both practicality and comfort to its inhabitants."
        ]
    },
    "ARKitScenes: 42897434": {
        "objects_info": [
            {
                "id": 0,
                "label": "cabinet",
                "position": [
                    -2.4470540285110474,
                    0.13953886553645134,
                    -0.8921290338039398
                ],
                "size": [
                    0.5798666477203369,
                    0.4411846771836281,
                    0.615742027759552
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_0.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The cabinet is a wooden storage cabinet with a smooth texture and a knob on it. It has a brown and white color and an octagonal shape. It is made of wood and can be used as a bedside table or for storage."
                    ],
                    "anno": [
                        "In the living room, facing the window with brown grids on top, there is a brown cabinet next to the bottom right corner of the window and the sofa."
                    ]
                }
            },
            {
                "id": 1,
                "label": "sofa",
                "position": [
                    -3.705289363861084,
                    -0.28341955691576004,
                    -0.8165840208530426
                ],
                "size": [
                    1.7281255722045898,
                    1.0612394660711288,
                    0.7685920596122742
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_1.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The plush couch, situated in front of the sturdy table and comfortable chair, graces the spacious room with its presence, its soft cushions inviting relaxation and its sturdy frame supporting the weight of lively gatherings.",
                        "The plush couch, adorned with vibrant throw pillows, sits proudly in the cozy living room, inviting everyone to lounge and relax, with its soft cushions and supportive backrest, perfect for snuggling up with a good book or enjoying a warm conversation with friends and family, while the stool and cabinet, also designed with functionality and style, complement the sofa's role as the centerpiece of the room, creating a"
                    ],
                    "template": [
                        "The sofa is in front of the table and chair , it is also on the top of floor .",
                        "The sofa is in front of the stool , and to the left of the cabinet and chair is the sofa  ."
                    ],
                    "obj_cap": [
                        "Beige leather two seater sofa with rectangular shape, oblong structure, and fabric material, suitable for living room usage and convertible to a bed."
                    ],
                    "anno": [
                        "In the living room, there is a bean green double leather sofa right below the window."
                    ]
                }
            },
            {
                "id": 2,
                "label": "fireplace",
                "position": [
                    -5.824213027954102,
                    -1.4849722236394882,
                    -0.3653860241174698
                ],
                "size": [
                    0.9094772338867188,
                    2.041099578142166,
                    1.6941680610179901
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_2.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The cozy fireplace, nestled between the plush sofa and sturdy stool, invites warmth and relaxation, its dancing flames casting a golden glow on the surrounding comforts.",
                        "The cozy fireplace, located to the left of the cabinet and chair, provides warmth and ambiance to the room, its dancing flames casting a golden glow on the surrounding furnishings, while its sturdy floor support ensures stability and safety for relaxing moments by the fire."
                    ],
                    "template": [
                        "The fireplace is in front of the sofa  and is to the left of stool, also is supported by floor .",
                        "The fireplace is to the left of the cabinet and chair , what's more, The fireplace is supported by the floor  ."
                    ],
                    "obj_cap": [
                        "The fireplace is a yellow, octagonal, wooden structure used for burning wood, with a brick or stone texture and a wood burning stove function. It has a traditional and classic style, often found in homes with a cozy atmosphere."
                    ],
                    "anno": [
                        "A black fireplace connected with black pipes, used for heating and warming."
                    ]
                }
            },
            {
                "id": 3,
                "label": "tv",
                "position": [
                    -5.2882444858551025,
                    -3.326364755630493,
                    -0.3964500054717064
                ],
                "size": [
                    0.7493176460266113,
                    0.582303524017334,
                    0.5036860257387161
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_3.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The TV is a black, octagonal-shaped, stainless steel and LCD flat screen television with a glossy black texture and a flat screen structure. It is used for watching TV and is typically found in living rooms."
                    ],
                    "anno": [
                        "In the living room, facing the fireplace, there is a black television on the left side against the wall corner."
                    ]
                }
            },
            {
                "id": 4,
                "label": "sofa",
                "position": [
                    -4.2481831312179565,
                    -3.288121819496155,
                    -0.8309639990329742
                ],
                "size": [
                    0.8369381427764893,
                    1.0179102420806885,
                    0.8006719946861267
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_4.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The sofa is a beige fabric or leather furniture piece with a cubic shape and a reclining function. It can be used as a bed and has a soft, fabric texture. The structure is a chair that has been folded in half or a recliner, with a curved design."
                    ],
                    "anno": [
                        "Facing the direction of the living room, there is a single-person sofa on the left side of the television."
                    ]
                }
            },
            {
                "id": 5,
                "label": "stool",
                "position": [
                    -2.387304186820984,
                    -3.6550610065460205,
                    -1.0244999825954437
                ],
                "size": [
                    0.38807129859924316,
                    0.29892587661743164,
                    0.3746200203895569
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_5.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The stool, positioned behind the sofa and resting on the floor, serves as a convenient seating option for those utilizing the cabinet, while also being accessible to the fireplace for optimal warmth and comfort."
                    ],
                    "template": [
                        "Facing the cabinet, The stool is behind the sofa  and is on the top of floor, also is to the right of fireplace ."
                    ],
                    "obj_cap": [
                        "The stool is a wooden octagon with a brown and white color scheme, used for sitting, and has a wooden texture and structure."
                    ],
                    "anno": [
                        "The brown-yellow stool is located next to the brown dining table, behind the door panel, against the wall, closest to the red single sofa."
                    ]
                }
            },
            {
                "id": 6,
                "label": "stool",
                "position": [
                    -5.026144027709961,
                    0.24949108064174652,
                    -1.0364224910736084
                ],
                "size": [
                    0.30791759490966797,
                    0.288556307554245,
                    0.3353149890899658
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_6.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The stool is a wooden, square-shaped object with a smooth texture and a hanging structure from the ceiling. It can be used as a bedside table, coffee table, or cat bed."
                    ],
                    "anno": [
                        "In the living room, directly below the window, there is a yellow sofa. On the left side of the sofa, closest to the curtains, there is a small square stool for sitting."
                    ]
                }
            },
            {
                "id": 7,
                "label": "table",
                "position": [
                    -1.8043380379676819,
                    -2.285756766796112,
                    -0.8246825039386749
                ],
                "size": [
                    0.7851647138595581,
                    1.8106600046157837,
                    0.750415027141571
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_7.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Behind the sofa, a table is nestled snugly next to a stool, while a chair offers a comfortable spot to sit and utilize the table's surface for various human activities."
                    ],
                    "template": [
                        "Facing the cabinet, The table is behind the sofa  and is next to stool, also is beside chair ."
                    ],
                    "obj_cap": [
                        "Brown wooden table with four chairs, octagonal shape, and smooth wooden texture. Can be used as a dining table."
                    ],
                    "anno": [
                        "In the living room, there is a brown rectangular dining table next to a pink single-seater sofa."
                    ]
                }
            },
            {
                "id": 8,
                "label": "chair",
                "position": [
                    -2.16635799407959,
                    -1.719535231590271,
                    -0.7673250287771225
                ],
                "size": [
                    0.49513864517211914,
                    0.4330251216888428,
                    0.8746500313282013
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_8.ply",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "The chair, located to the left of the stool and right of the sofa, enjoys a cozy spot adjacent to the table, inviting anyone nearby to take a seat and relax.",
                        "The chair, located to the right of the stool and sofa, takes center stage in the room, with another chair positioned directly in front of it, creating a cozy seating arrangement perfect for relaxation and socializing."
                    ],
                    "template": [
                        "Facing the cabinet, The chair is to the left of the stool  and is to the right of sofa, also is adjacent to table .",
                        "Facing the cabinet, The chair is to the right of the stool and sofa , what's more, The chair is in front of another chair  ."
                    ],
                    "obj_cap": [
                        "Brown wooden chair with a triangle shape, used as a child's chair or dining chair, has a wooden texture and structure, and is made of wood."
                    ],
                    "anno": [
                        "In the living room, facing away from the fireplace, under the yellow dining table against the wall in front, among the outer row of three yellow chairs, the leftmost one is a yellow armchair."
                    ]
                }
            },
            {
                "id": 9,
                "label": "chair",
                "position": [
                    -2.118610978126526,
                    -2.1971556544303894,
                    -0.7581060081720352
                ],
                "size": [
                    0.48906636238098145,
                    0.48813068866729736,
                    0.8890080153942108
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_9.ply",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "Behind the cabinet, a comfortable armchair sits, nestled between a plush sofa and a sturdy stool, providing ample seating options for relaxation or work, with the added convenience of being easily accessible from the left side.",
                        "Behind the cabinet, a comfortable armchair sits, awaiting a user to relax and enjoy the surrounding atmosphere, while a sofa and stool to its right offer additional seating options, creating a cozy seating area perfect for socializing or reading a book."
                    ],
                    "template": [
                        "Facing towards the cabinet, The chair is behind the chair and sofa , it is also to the left of stool .",
                        "Facing the cabinet, The chair is behind the chair and sofa , it is also to the left of stool ."
                    ],
                    "obj_cap": [
                        "The chair is a wooden chair with a ladder-like structure, octagonal shape, and a brown color. It can be used as a dining chair or a child's chair, and has a wooden texture and structure."
                    ],
                    "anno": [
                        "In the chairs surrounding the brown table, near the side of the door panel. The chair in the middle."
                    ]
                }
            },
            {
                "id": 10,
                "label": "chair",
                "position": [
                    -2.0682279467582703,
                    -2.6559016704559326,
                    -0.7571344822645187
                ],
                "size": [
                    0.5419055223464966,
                    0.45589351654052734,
                    0.8949309885501862
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_10.ply",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "Behind the cabinet, a chair is positioned on the floor to the left of a stool, while another chair is placed in front of it.",
                        "The chair, positioned behind the sofa and resting on the floor, serves as a comfortable seating option for guests, while its proximity to the table makes it an ideal spot for enjoying a meal or engaging in conversation."
                    ],
                    "template": [
                        "Facing towards the cabinet, The chair is behind another chair  and is placed on floor, also is to the left of stool .",
                        "Facing the cabinet, The chair is behind the sofa  and is placed on floor, also is beside table ."
                    ],
                    "obj_cap": [
                        "The chair is a wooden chair with a brown color, triangle shape, and octagonal 3D shape. It can be used as a high chair, dining chair, stool, or child's chair, and has a wooden texture and structure."
                    ],
                    "anno": [
                        "In the living room, the chair furthest from the red sofa is under the brown dining table."
                    ]
                }
            },
            {
                "id": 11,
                "label": "chair",
                "position": [
                    -1.8155556321144104,
                    -3.0919816493988037,
                    -0.8255120068788528
                ],
                "size": [
                    0.3956669569015503,
                    0.4143075942993164,
                    0.7520759999752045
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_11.ply",
                "count": 5,
                "caption": {
                    "obj_cap": [
                        "The chair is a wooden chair with a brown color, cubic shape, and ladder-like structure. It can be used as a bed, desk chair, or dining chair, and has a wooden texture and structure."
                    ],
                    "anno": [
                        "The chair in the bottom right corner of the wooden table facing the fireplace."
                    ]
                }
            },
            {
                "id": 12,
                "label": "chair",
                "position": [
                    -1.6840484142303467,
                    -1.5766250491142273,
                    -0.7439809888601303
                ],
                "size": [
                    0.4602212905883789,
                    0.47287166118621826,
                    0.9198379814624786
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_12.ply",
                "count": 5,
                "caption": {
                    "rewrite": [
                        "The chair takes center stage, positioned in front of a companion chair, with a sofa and cozy fireplace to its right, inviting relaxation and socializing.",
                        "The chair, located behind the sofa, boasts a sturdy frame and comfortable cushioning, perfect for relaxing and reading a book, while the matching stool and chair in front of it create a harmonious seating arrangement for a cozy living room."
                    ],
                    "template": [
                        "The chair is in front of another chair , and The chair is to the right of the sofa and fireplace  .",
                        "The chair is behind the sofa , and The chair is in front of the stool and chair  ."
                    ],
                    "obj_cap": [
                        "The chair is a brown, wooden, high chair with a ladder-like structure and a rocking motion. It has a oblong shape and can be used as a chair or a high chair. It has a wooden texture and is made of wood."
                    ],
                    "anno": [
                        "The rectangular chair closest to the wall among the brown chairs surrounding the brown table, closest to the red chair."
                    ]
                }
            },
            {
                "id": 13,
                "label": "stool",
                "position": [
                    -1.2830957770347595,
                    -2.367965579032898,
                    -0.9765025079250336
                ],
                "size": [
                    0.2850567102432251,
                    1.259190320968628,
                    0.4467349648475647
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_13.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The stool, located between the chair and the cabinet, serves as a convenient perch for a weary visitor, its sturdy frame and comfortable cushioning providing a cozy spot to rest while enjoying the warmth of the nearby fireplace."
                    ],
                    "template": [
                        "The stool is in front of the chair  and is behind cabinet, also is to the right of fireplace ."
                    ],
                    "obj_cap": [
                        "The stool is made of wood, has a brown color, and a triangle shape. It can be used as a seat or chair, and has a wooden texture and structure."
                    ],
                    "anno": [
                        "In the room, there is a brown table surrounded by chairs, and three of the chairs are positioned next to the wall mirror."
                    ]
                }
            },
            {
                "id": 14,
                "label": "sofa",
                "position": [
                    -1.4661045670509338,
                    -0.7584989666938782,
                    -0.8044605255126953
                ],
                "size": [
                    0.8732889890670776,
                    0.864096999168396,
                    0.7764990329742432
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/obj/obj_14.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The plush sofa, with its soft cushions and inviting design, sits comfortably on the floor, strategically positioned to the right of the stool, creating a cozy seating area for relaxation and conversation."
                    ],
                    "template": [
                        "on the floor is the sofa  and is to the right of sofa, also is in front of stool ."
                    ],
                    "obj_cap": [
                        "A red leather sofa with a curved shape, swivel chair function, and a luxurious feel."
                    ],
                    "anno": [
                        "In the living room, facing the window, to the right front of the window, there is a red sofa."
                    ]
                }
            }
        ],
        "mesh_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/42897434_3dod_mesh.ply",
        "seg_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/ARKitScenes/raw/Training/42897434/42897434_3dod_mesh.labels.ply",
        "align_mat": 3.539,
        "scene_cap": [
            "In this room, there are 5 chairs, 3 stools, and 3 sofas. The spatial relations between the objects are as follows: the sofa is in front of the chair, the sofa is to the left of the stool, the chair is behind the sofa, the chair is behind the stool, the stool is to the right of the sofa, and the stool is in front of the chair. The room appears to be furnished for seating and relaxation, with a mix of chairs, stools, and sofas arranged in a way that allows for comfortable conversation and socializing.",
            "In this room, there are 5 chairs, 3 stools, 1 cabinet, and 3 sofas. The chairs are positioned to the right of the sofas and stools, with one chair in front of another chair. The cabinet is placed in front of a chair, while another chair is positioned behind the cabinet. The chairs are also to the right of another chair, and a stool is located behind one of the chairs. The room appears to be furnished for seating and relaxation, with a focus on comfort and functionality.",
            "In this room, there is a fireplace, a table, stools, a TV, sofas, and chairs. The chairs are arranged in a way that they are adjacent to each other, with one chair behind another. The table is close to the chairs, and the stools are positioned to the right and left of the chairs. The sofa is placed in front of the chairs. The room seems to be designed for relaxation and socializing, with comfortable seating options and a cozy fireplace."
        ]
    },
    "MultiScan: scene_00097_02": {
        "objects_info": [
            {
                "id": 0,
                "label": "window",
                "position": [
                    3.036317,
                    -1.752627,
                    0.356211
                ],
                "size": [
                    1.4085099999999997,
                    0.11076599999999992,
                    1.551462
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_0.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "A white, octagon-shaped window with aluminum frames and cellular shades, allowing natural light and vision from the outside. It has a smooth texture and is a single pane of glass. It is a bathroom window and has blinds on it, allowing privacy and light control."
                    ],
                    "anno": [
                        "Facing the television, there are two windows. The target object is the white-framed bay window closer to the gray single-person sofa."
                    ]
                }
            },
            {
                "id": 1,
                "label": "window",
                "position": [
                    -1.391497,
                    -1.7439725,
                    0.357473
                ],
                "size": [
                    1.522554,
                    0.2097469999999999,
                    1.6039240000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_1.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "White octagonal aluminium window with frosted glass and casement style, used for natural light and ventilation in bathrooms and kitchens."
                    ],
                    "anno": [
                        "Facing the end of the bed, the target object is the white rectangular white window to the right of the television."
                    ]
                }
            },
            {
                "id": 2,
                "label": "tv",
                "position": [
                    0.6829965,
                    -1.6633330000000002,
                    0.0812045
                ],
                "size": [
                    1.0478109999999998,
                    0.144636,
                    0.644311
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_2.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The TV is a black, white, or wood-colored, octagon-shaped, flat screen TV with a glass or wood material, used for watching TV shows or movies, mounted on a wall in a living room, and has a smooth, flat texture. It is a smart TV and an HDTV."
                    ],
                    "anno": [
                        "Facing the bed, across the wall, there is a yellow small shelf with a black square television on the top."
                    ]
                }
            },
            {
                "id": 3,
                "label": "shelf",
                "position": [
                    0.717126,
                    -1.637689,
                    -0.47475
                ],
                "size": [
                    1.117284,
                    0.22216999999999998,
                    0.28622600000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_3.ply",
                "count": 4,
                "caption": {
                    "obj_cap": [
                        "The shelf is made of wood and has a rectangular shape. It can be used to store things, as a bookshelf, or as a charging station. It has a wooden texture and is attached to the wall."
                    ],
                    "anno": [
                        "In front of the television, there is a brown rectangular shelf."
                    ]
                }
            },
            {
                "id": 4,
                "label": "case",
                "position": [
                    0.706186,
                    -1.401648,
                    -1.107324
                ],
                "size": [
                    0.499376,
                    0.41146400000000005,
                    0.45255999999999996
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_4.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "To locate the case in the picture, look behind the bed, which is positioned lower than the image.",
                        "The case can be found concealed behind the backpack, which is positioned in front of the lamp.",
                        "The case can be found hiding behind the backpack, which is nestled beneath the lamp's warm glow.",
                        "Behind the backpack, which is situated below the light switch, lies the case.",
                        "Locating the case from the clothes hanger can be done by first identifying the refrigerator, which is positioned lower than the clothes hanger, and then looking behind it to find the case.",
                        "To locate the case from the blanket, you can start by identifying the location of the refrigerator, which is positioned lower than the blanket, and then look behind it to find the case.",
                        "The case is situated behind the backpack, which is positioned lower than the power outlet.",
                        "The backpack and trash bin are positioned in front of the case, which is nestled against the left side of the sofa, creating a cozy nook for storing and accessing personal items.",
                        "The bedside table, located to the left of the bed and supported by the floor, hosts a case that blends seamlessly into the surrounding environment, providing ample storage space and within comfortable reach of human activity."
                    ],
                    "template": [
                        "The bed is lower than the picture , and The case is behind the bed",
                        "The backpack is lower than the lamp , and The case is behind the backpack",
                        "The backpack is below the lamp , while The case is behind the backpack",
                        "below the light switch is the backpack , and The case is behind the backpack",
                        "The refrigerator is lower than the clothes hanger , while The case is behind the refrigerator",
                        "The refrigerator is lower than the blanket , and The case is behind the refrigerator",
                        "The backpack is lower than the power outlet , while The case is behind the backpack",
                        "The case is to the left of the sofa , and The case is behind the backpack and trash bin  .",
                        "The case is behind the bed  and is to the left of lamp, also is supported by floor ."
                    ],
                    "obj_cap": [
                        "The object in the captions is a red plastic cooler with a rectangular shape and smooth texture. It has a compartment to store items and can be used to keep things cold. It is made of plastic and has a red and white color scheme. It can be used to store earplugs, hold a book, or store a laptop. It has a simple structure with two drawers and can be used as a bookcase or toilet paper holder. It is not a tv case or a suitcase."
                    ],
                    "anno": [
                        "The open red box is placed on the floor below the black television."
                    ]
                }
            },
            {
                "id": 5,
                "label": "sofa",
                "position": [
                    2.8860535,
                    -0.6700585,
                    -0.9592430000000001
                ],
                "size": [
                    1.101505,
                    1.113231,
                    0.7913500000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_5.ply",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "The sofa is situated to the right of the bed, which is positioned lower than the picture.",
                        "The sofa is located to the right of the backpack, which is positioned below the lamp.",
                        "The sofa can be found behind the backpack, which is positioned below the lamp.",
                        "The sofa is situated to the right of the backpack, which is positioned below the light switch.",
                        "The sofa is situated to the right of the refrigerator, which is positioned below the clothes hanger.",
                        "The sofa is situated to the right of the refrigerator, which is positioned lower than the blanket.",
                        "The sofa is situated behind the backpack, which is positioned lower than the power outlet.",
                        "The plush sofa, adorned with throw pillows and a soft blanket, invites relaxation as it nestles beside the table, slightly angled to face the bed, while its sturdy back provides a comfortable resting spot for weary heads, and its strategic placement behind the desk makes it an ideal spot for brainstorming sessions or workspace for laptop use."
                    ],
                    "template": [
                        "lower than the picture is the bed , and The sofa is to the right of the bed",
                        "The backpack is lower than the lamp , while The sofa is to the right of the backpack",
                        "The backpack is below the lamp , while The sofa is behind the backpack",
                        "The backpack is below the light switch , and The sofa is to the right of the backpack",
                        "The refrigerator is lower than the clothes hanger , and The sofa is to the right of the refrigerator",
                        "lower than the blanket is the refrigerator , while The sofa is to the right of the refrigerator",
                        "The backpack is lower than the power outlet , while The sofa is behind the backpack",
                        "The sofa is beside the table  and is to the right of bed, also is behind desk ."
                    ],
                    "obj_cap": [
                        "A grey fabric sofa with a cushion, blanket, and black legs. It can be used as a bed or lounge chair and has a back and arms. The texture is soft and smooth, while the structure is sturdy and supportive."
                    ],
                    "anno": [
                        "In the room, between two sofas, the closest one to the blinds is a gray square sofa."
                    ]
                }
            },
            {
                "id": 6,
                "label": "sofa",
                "position": [
                    2.932831,
                    0.6956169999999999,
                    -0.950364
                ],
                "size": [
                    1.0715299999999996,
                    1.081156,
                    0.7410220000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_6.ply",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "The sofa can be found to the left of the bed when facing it, with the bed positioned lower than the picture.",
                        "The sofa is located to the left of the backpack, which is positioned facing towards the lamp.",
                        "The sofa can be found by following the trajectory from the lamp, past the backpack, and towards the furthest wall.",
                        "As you face the light switch, the sofa is situated to the left of the backpack, which is positioned directly beneath the switch.",
                        "As you stand in front of the sofa, you can locate it to the left of the refrigerator, which is positioned lower than the clothes hanger.",
                        "Locating the sofa from the blanket, I notice that the refrigerator stands lower than the blanket, and as I face the sofa, it lies to the left of the refrigerator.",
                        "The sofa is located behind the backpack, which is positioned lower than the power outlet.",
                        "The plush sofa, with its soft cushions and supportive backrest, is strategically positioned to the right of the bed, providing a comfortable seating area for relaxation and reading, while also being within reach of the bed for easy access.",
                        "The comfortable, gray sofa, with its soft cushions and supportive backrest, is situated behind the trash bin and backpack, and conveniently adjacent to the table, allowing for easy access and relaxation."
                    ],
                    "template": [
                        "The bed is lower than the picture , and Facing the sofa, The sofa is to the left of the bed",
                        "The backpack is lower than the lamp , while Facing towards the sofa, The sofa is to the left of the backpack",
                        "The backpack is below the lamp , and The sofa is behind the backpack",
                        "The backpack is below the light switch , while Standing in front of the sofa, The sofa is to the left of the backpack",
                        "The refrigerator is lower than the clothes hanger , while Standing in front of the sofa, The sofa is to the left of the refrigerator",
                        "The refrigerator is lower than the blanket , and Standing in front of the sofa, The sofa is to the left of the refrigerator",
                        "The backpack is lower than the power outlet , while The sofa is behind the backpack",
                        "The sofa is to the right of the bed  and is placed on floor, also is in front of sofa .",
                        "The sofa is behind the trash bin and backpack , what's more, The sofa is adjacent to the table  ."
                    ],
                    "obj_cap": [
                        "A gray fabric sofa with a pillow, used as a bed or lounge chair, has a back and arms, and a wooden frame."
                    ],
                    "anno": [
                        "Next to the bed in the bedroom, there is a gray sofa chair facing away from the bed."
                    ]
                }
            },
            {
                "id": 7,
                "label": "table",
                "position": [
                    3.494507,
                    -0.043132000000000004,
                    -1.0671110000000001
                ],
                "size": [
                    0.7312779999999997,
                    0.732468,
                    0.481212
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_7.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "To locate the table in the picture, look for the bed first, which is the largest furniture piece in the room, and then search to its right-hand side, where the table is likely to be placed.",
                        "The table is located adjacent to the right side of the backpack, which is positioned below the lamp.",
                        "The table can be found by tracing a line from the base of the lamp to the backpack's lower edge and extending it to the ground.",
                        "The table is situated to the right of the backpack, which is positioned below the light switch.",
                        "Locating the table from the clothes hanger, you can follow the refrigerator's vertical line to the right, where the table stands adjacent to it.",
                        "The table is situated to the right of the refrigerator, which is lower than the blanket.",
                        "Locate the table by first identifying the power outlet, then look behind the backpack, which is positioned lower than the outlet, to find the table.",
                        "The table, positioned to the right of the refrigerator and behind the desk, enjoys a cozy spot in the room, illuminated by the warm glow of the nearby lamp, inviting humans to gather round and engage in various activities.",
                        "The table, positioned behind the trash bin and in proximity to the comfortable sofa, rests solidly on the floor, its surface extending an invitation to place a cup of coffee or a book, while the nearby bin ensures that disposing of waste is a convenient and hygienic process."
                    ],
                    "template": [
                        "lower than the picture is the bed , and The table is to the right of the bed",
                        "The backpack is lower than the lamp , and The table is to the right of the backpack",
                        "The backpack is below the lamp , and The table is behind the backpack",
                        "The backpack is below the light switch , while The table is to the right of the backpack",
                        "The refrigerator is lower than the clothes hanger , while The table is to the right of the refrigerator",
                        "The refrigerator is lower than the blanket , while The table is to the right of the refrigerator",
                        "The backpack is lower than the power outlet , and behind the backpack is the table",
                        "to the right of the refrigerator is the table  and is behind desk, also is in front of lamp .",
                        "The table is behind the trash bin  and is close to sofa, also is supported by floor ."
                    ],
                    "obj_cap": [
                        "The table is a wooden, rectangular coffee table with a smooth, wooden texture and a simple, traditional structure. It has a white, gray, brown, or yellow finish and can have mugs, a brown bag, or a chair placed on it."
                    ],
                    "anno": [
                        "In the bedroom, among all the tables, the table closest to the sofa covered with a white blanket."
                    ]
                }
            },
            {
                "id": 8,
                "label": "kettle",
                "position": [
                    3.742397,
                    1.6792924999999999,
                    -0.3501855
                ],
                "size": [
                    0.1488839999999998,
                    0.18380700000000005,
                    0.17222700000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_8.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The kettle is a red, spherical, stainless steel object with a smooth texture and a handle. It is used to boil water and has a lid. It is often kept on a stovetop."
                    ],
                    "anno": [
                        "In the bedroom, facing the gray curtains, on the yellow table in the far left corner, there is a red kettle."
                    ]
                }
            },
            {
                "id": 9,
                "label": "desk",
                "position": [
                    3.588348,
                    1.5429575,
                    -0.862601
                ],
                "size": [
                    0.6647180000000001,
                    0.6771929999999999,
                    0.89507
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_9.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The desk can be found to the left of the bed when facing the table, and it is situated lower than the picture.",
                        "The desk is located to the left of the backpack, which is positioned facing the table.",
                        "The desk is located diagonally left from the lamp, situated near the backpack which is facing the table.",
                        "The desk is situated to the left of the backpack, which is positioned below the light switch.",
                        "The desk can be found to the left of the refrigerator, which is positioned below the clothes hanger.",
                        "Locate the table facing the refrigerator, and you'll find the desk to its left.",
                        "The desk is situated to the left of the backpack, facing the table, and can be easily located by following the direction of the power outlet's cord.",
                        "The desk, a sleek and modern workspace, is situated in front of the table, to the right of the refrigerator, and conveniently adjacent to the trash bin, inviting users to engage in productive activities while enjoying the comfort of the surrounding environment."
                    ],
                    "template": [
                        "The bed is lower than the picture , while Facing the table, The desk is to the left of the bed",
                        "The backpack is lower than the lamp , while Facing the table, The desk is to the left of the backpack",
                        "The backpack is below the lamp , while Facing the table, The desk is to the left of the backpack",
                        "below the light switch is the backpack , and Standing in front of the table, The desk is to the left of the backpack",
                        "The refrigerator is lower than the clothes hanger , and Facing the table, The desk is to the left of the refrigerator",
                        "The refrigerator is lower than the blanket , while Facing towards the table, to the left of the refrigerator is the desk",
                        "The backpack is lower than the power outlet , and Facing the table, to the left of the backpack is the desk",
                        "The desk is in front of the table  and is to the right of refrigerator, also is adjacent to trash bin ."
                    ],
                    "obj_cap": [
                        "The desk is a wooden octagon with a glass top, two drawers, and a shelf. It has a small, sleek design and can be used as a coffee table or a workspace. The texture is wood, and the structure is simple and minimalist."
                    ],
                    "anno": [
                        "Below the painting, next to the curtain and against the wall, there is a light brown square table."
                    ]
                }
            },
            {
                "id": 10,
                "label": "trash bin",
                "position": [
                    3.1874314999999998,
                    1.643613,
                    -1.1799754999999998
                ],
                "size": [
                    0.3749670000000003,
                    0.34540799999999994,
                    0.287053
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_10.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The trash bin can be found to the left of the bed when standing in front of the table, and it appears lower than the picture.",
                        "The trash bin can be found to the left of the backpack, which is positioned facing towards the table and below the lamp.",
                        "As you face the table, the trash bin is situated to the left of the backpack, which is positioned beneath the lamp.",
                        "As you stand in front of the table, the trash bin is situated to the left of the backpack, which is positioned below the light switch.",
                        "Locate the table directly in front of the refrigerator, and to the left of the table, you'll find the trash bin, nestled beneath the clothes hanger.",
                        "Locate the refrigerator, which is positioned lower than the blanket, and then look to its left to find the trash bin.",
                        "The trash bin is located to the left of the backpack, which is positioned below the power outlet.",
                        "The trash bin, conveniently located near the backpack and easily accessible from the case and sofa, serves as a handy repository for disposing of unwanted items, promoting a tidy and organized living space.",
                        "The trash bin, located conveniently on the floor to the right of the bed and in front of the sofa, stands ready to efficiently collect and dispose of waste, providing a comfortable and hygienic solution for the room's occupants."
                    ],
                    "template": [
                        "The bed is lower than the picture , while Standing in front of the table, The trash bin is to the left of the bed",
                        "The backpack is lower than the lamp , and Facing towards the table, The trash bin is to the left of the backpack",
                        "The backpack is below the lamp , while Standing in front of the table, The trash bin is to the left of the backpack",
                        "below the light switch is the backpack , while Standing in front of the table, The trash bin is to the left of the backpack",
                        "The refrigerator is lower than the clothes hanger , while Directly facing the table, to the left of the refrigerator is the trash bin",
                        "The refrigerator is lower than the blanket , while Facing the table, The trash bin is to the left of the refrigerator",
                        "The backpack is lower than the power outlet , while Facing the table, The trash bin is to the left of the backpack",
                        "The trash bin is to the right of the backpack , and The trash bin is in front of the case and sofa  .",
                        "resting on the floor is the trash bin  and is to the right of bed, also is in front of sofa ."
                    ],
                    "obj_cap": [
                        "The trash bin is a blue, plastic, circular object with a smooth texture and a lid on top. It is used for storing and carrying trash from one place to another."
                    ],
                    "anno": [
                        "Between the bed and the gray curtains, there is a blue cylindrical trash can against the wall."
                    ]
                }
            },
            {
                "id": 11,
                "label": "backpack",
                "position": [
                    2.1504,
                    1.6854965,
                    -1.134659
                ],
                "size": [
                    0.461438,
                    0.3312789999999999,
                    0.41238200000000014
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_11.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The backpack can be found beneath the lamp, which is positioned higher up on the shelf.",
                        "The backpack can be found resting beside the bed, situated lower than the frame holding the photo.",
                        "The backpack is situated below the lamp, aligned with its base.",
                        "The backpack is situated adjacent to the light switch, accessible by moving towards the illumination source.",
                        "The backpack can be found to the right of the refrigerator, which is located below the clothes hanger.",
                        "The backpack is situated to the right of the refrigerator, which is lower than the blanket.",
                        "The backpack, a sturdy and comfortable companion, sits proudly in front of the plush sofa, within arm's reach, its versatile compartments eager to store and organize an array of essentials for the busy individual, while the matching wardrobe to its right adds a touch of elegance to the room's decor.",
                        "The backpack, positioned to the right of the refrigerator and wardrobe, sits humbly beneath the power outlet, eager to serve its purpose."
                    ],
                    "template": [
                        "The lamp is higher than the shelf , and The backpack is below the lamp",
                        "The bed is lower than the picture , while next to the bed is the backpack",
                        "The backpack is lower than the lamp , while The backpack is to the right of another backpack",
                        "The backpack is below the light switch , and The backpack is to the right of another backpack",
                        "The refrigerator is lower than the clothes hanger , and The backpack is to the right of the refrigerator",
                        "The refrigerator is lower than the blanket , while The backpack is to the right of the refrigerator",
                        "The backpack is in front of the sofa , and The backpack is to the right of the wardrobe and backpack  .",
                        "The backpack is to the right of the refrigerator and wardrobe , what's more, The backpack is lower than the power outlet  ."
                    ],
                    "obj_cap": [
                        "The backpack is black, made of leather or neoprene, and has a laptop compartment. It is oblong or octagonal in shape and has a zippered closure. The backpack is designed to carry a laptop and has a smooth, leather texture."
                    ],
                    "anno": [
                        "In the room, right in front of the bed, there is a black backpack placed tightly against the floor on the right side of the bed."
                    ]
                }
            },
            {
                "id": 12,
                "label": "shelf",
                "position": [
                    2.1727914999999998,
                    1.7786845,
                    -0.8142754999999999
                ],
                "size": [
                    0.5004709999999999,
                    0.11770300000000011,
                    0.23529900000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_12.ply",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The shelf can be found below the lamp, which is positioned higher than the backpack.",
                        "The shelf is situated below the lamp, which is elevated above the power outlet."
                    ],
                    "template": [
                        "higher than the backpack is the lamp , while The shelf is lower than the lamp",
                        "The lamp is higher than the power outlet , while The shelf is lower than the lamp"
                    ],
                    "obj_cap": [
                        "The shelf is a wooden cube with a brown finish, used for storing items such as books or a cell phone. It has a smooth wood texture and is made of wood and metal."
                    ],
                    "anno": [
                        "Standing at the foot of the bed, facing the head of the bed, on the right side of the head of the bed, above the black backpack, there is a light brown rectangular small cabinet with a white remote control placed on top."
                    ]
                }
            },
            {
                "id": 13,
                "label": "picture",
                "position": [
                    3.237225,
                    1.8397085,
                    0.285576
                ],
                "size": [
                    0.787452,
                    0.04728699999999986,
                    0.550574
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_13.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "A vibrant orange sunset is depicted in a photo printed on canvas, capturing the warm tones and peaceful atmosphere of the scene. The texture is smooth, and the structure is a canvas print, making it a beautiful piece of art for any room."
                    ],
                    "anno": [
                        "Facing the white bed, there is a red and black hanging painting on the wall to the right of the bed."
                    ]
                }
            },
            {
                "id": 14,
                "label": "pillow",
                "position": [
                    1.1808144999999999,
                    1.385292,
                    -0.47393150000000006
                ],
                "size": [
                    0.7098829999999999,
                    0.5018959999999999,
                    0.297499
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_14.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "The pillow is a white, octagon-shaped flannel pillow with a soft and fluffy texture. It can be used as a bed pillow, headrest, or blanket, and has a pillowcase made of cotton fabric."
                    ],
                    "anno": [
                        "Facing the head of the bed, the white pillow furthest to the right side of the bed."
                    ]
                }
            },
            {
                "id": 15,
                "label": "pillow",
                "position": [
                    1.1400145,
                    1.453395,
                    -0.48507849999999997
                ],
                "size": [
                    0.7748189999999999,
                    0.3315640000000002,
                    0.340827
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_15.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "A white, oblong pillow with a silky texture and fluffy structure, used for sleeping and intimacy, and can be found on a bed or used as a blanket."
                    ],
                    "anno": [
                        "Among the three pillows near the curtains at the head of the bed, the one in the middle."
                    ]
                }
            },
            {
                "id": 16,
                "label": "pillow",
                "position": [
                    1.231577,
                    1.6218895,
                    -0.463071
                ],
                "size": [
                    0.5236119999999999,
                    0.242977,
                    0.36342399999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_16.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "The pillow is white, made of cotton or polyester, and has a soft, fluffy texture. It can be used for sleeping, as a comforter, blanket, or headrest. It has an oblong or octagonal shape and comes with a white or beige cover."
                    ],
                    "anno": [
                        "Facing the head of the bed, the white pillow is leaning against an orange-yellow wooden board on the right side of the bed."
                    ]
                }
            },
            {
                "id": 17,
                "label": "pillow",
                "position": [
                    0.37376349999999997,
                    1.306142,
                    -0.5000055
                ],
                "size": [
                    0.690111,
                    0.34499199999999997,
                    0.27571300000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_17.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "White heart-shaped pillow with a soft and fluffy texture, made of cotton fabric, can be used as a headrest or throw pillow."
                    ],
                    "anno": [
                        "When facing the head of the bed, the left side has a white square pillow on the top."
                    ]
                }
            },
            {
                "id": 18,
                "label": "pillow",
                "position": [
                    0.34931100000000004,
                    1.488303,
                    -0.4855895
                ],
                "size": [
                    0.672906,
                    0.29194999999999993,
                    0.321377
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_18.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "A white, oblong-shaped pillow made of soft, fluffy cotton or flannel, with a white cover or striped pattern, used as a head or bed pillow."
                    ],
                    "anno": [
                        "Among the row of pillows near the red and white wallpaper on the bed, the white pillow in the middle."
                    ]
                }
            },
            {
                "id": 19,
                "label": "pillow",
                "position": [
                    0.399721,
                    1.667808,
                    -0.4926515
                ],
                "size": [
                    0.46968000000000004,
                    0.14503399999999989,
                    0.37719100000000005
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_19.ply",
                "count": 6,
                "caption": {
                    "obj_cap": [
                        "A white pillow with a soft, fluffy texture and a rectangular shape, typically used as a footstool or footrest, and often covered with a white or gray cover."
                    ],
                    "anno": [
                        "In the bedroom, facing the head of the bed, on the left side of the head of the bed, there is a black and white pillow used for sleeping that is closest to the brown headboard."
                    ]
                }
            },
            {
                "id": 20,
                "label": "bed",
                "position": [
                    0.842451,
                    0.7150875,
                    -0.6726894999999999
                ],
                "size": [
                    2.2694479999999997,
                    2.256601,
                    1.345809
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_20.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The bed can be found adjacent to the backpack, which is positioned below the lamp.",
                        "The bed is situated near the backpack, which is positioned beneath the lamp.",
                        "The bed is situated adjacent to the backpack, which is positioned beneath the light switch.",
                        "As you face the clothes hanger, the bed can be found to the left of the refrigerator, which is positioned lower than the hanger.",
                        "Locate the refrigerator and blanket first, then look left of the fridge to find the bed.",
                        "The bed is situated near the backpack, which is positioned below the power outlet.",
                        "The bed, situated in front of the case and lower than the picture, is also positioned to the left of the trash bin, serving as a comfortable spot for rest and relaxation.",
                        "The bed, located to the right of the shoe and left of the lamp and table, promises a comfortable sleeping experience, with its soft mattress and plush pillows inviting weariness to melt away, while the nearby table offers a convenient surface for a bedtime read or late-night snack."
                    ],
                    "template": [
                        "The backpack is lower than the lamp , and The bed is beside the backpack",
                        "The backpack is below the lamp , and The bed is close to the backpack",
                        "The backpack is below the light switch , and The bed is beside the backpack",
                        "The refrigerator is lower than the clothes hanger , while Directly facing the case, The bed is to the left of the refrigerator",
                        "The refrigerator is lower than the blanket , and Facing towards the case, The bed is to the left of the refrigerator",
                        "The backpack is lower than the power outlet , and The bed is close to the backpack",
                        "The bed is in front of the case  and is lower than picture, also is to the left of trash bin .",
                        "The bed is to the right of the shoe , and The bed is to the left of the lamp and table  ."
                    ],
                    "obj_cap": [
                        "The bed is a queen size wooden bed with a headboard and footboard. It has a rectangular shape and is made of wood. It can be used as a sofa bed or a guest bed. The texture is wooden, and the structure includes a headboard and footboard."
                    ],
                    "anno": [
                        "In the middle of the room, there is a bed with four white pillows and two patterned pillows."
                    ]
                }
            },
            {
                "id": 21,
                "label": "picture",
                "position": [
                    0.8480335,
                    1.813423,
                    0.211183
                ],
                "size": [
                    2.020837,
                    0.08062199999999997,
                    0.174592
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_21.ply",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "The picture is situated above the bed, which is proximate to the left side of the case, and can be accessed by standing in front of the sofa.",
                        "The picture is situated above the bed, which is to the left of the sofa.",
                        "The picture is situated above the bed, which is adjacent to the right side of the sofa.",
                        "The picture is situated above the bed, which is to the left of the table.",
                        "The picture is situated above the bed, which is to the left of the desk.",
                        "The picture is positioned above the bed, which is situated to the left of the trash bin.",
                        "The picture is positioned above the bed, which is adjacent to the backpack.",
                        "The picture is located above the bed, which is to the left of the backpack.",
                        "The picture is situated above the bed, adjacent to the backpack.",
                        "The picture is situated above the bed, which is to the left of the wardrobe.",
                        "The picture is situated above the bed, at a higher elevation than the bed, and can be accessed by turning left from the shoe.",
                        "The picture is situated above the bed, which is to the right of the lamp.",
                        "The picture hangs above the bed, elevated by the wall's embrace.",
                        "The picture is situated above the bed, which is to the left of the refrigerator, and can be seen directly facing the case."
                    ],
                    "template": [
                        "Standing in front of the sofa, The bed is close to the left of the case , and The picture is higher than the bed",
                        "The bed is to the left of the sofa , while The picture is higher than the bed",
                        "Facing towards the case, The bed is close to the right of the sofa , while The picture is higher than the bed",
                        "The bed is to the left of the table , and The picture is higher than the bed",
                        "The bed is to the left of the desk , while higher than the bed is the picture",
                        "The bed is to the left of the trash bin , and The picture is higher than the bed",
                        "The bed is close to the backpack , while The picture is higher than the bed",
                        "Facing towards the case, The bed is to the left of the backpack , and The picture is higher than the bed",
                        "beside the backpack is the bed , while The picture is higher than the bed",
                        "Facing the case, The bed is to the left of the wardrobe , while The picture is higher than the bed",
                        "Directly facing the case, to the left of the shoe is the bed , while The picture is higher than the bed",
                        "Facing the case, The bed is to the right of the lamp , while The picture is higher than the bed",
                        "The bed is placed on the floor , and The picture is higher than the bed",
                        "Directly facing the case, The bed is to the left of the refrigerator , and The picture is higher than the bed"
                    ],
                    "obj_cap": [
                        "A wooden shelf with moss on it, a living wall with moss hanging from the ceiling, a picture of a tree, and a black frame with a green plant on it. The objects are made of wood, moss, and glass, and have a rectangular, square, oblong, and cubic shape. They are used for decoration, can be used as a wallpaper, and have a smooth texture."
                    ],
                    "anno": [
                        "Facing the direction of the head of the bed, on the wall above the head of the bed, there is a black rectangular picture."
                    ]
                }
            },
            {
                "id": 22,
                "label": "lamp",
                "position": [
                    -0.496154,
                    1.770413,
                    0.3917155
                ],
                "size": [
                    0.13935999999999993,
                    0.13629999999999987,
                    0.21230099999999996
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_22.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The lamp can be found directly above the backpack, which is situated in front of the case.",
                        "The lamp can be found directly above the backpack, which is located to the left of the sofa.",
                        "The lamp is positioned vertically above the backpack, which is situated to the left of the sofa.",
                        "The lamp can be found hovering above the backpack, which is situated to the left of the table.",
                        "The lamp is situated above the backpack, which is positioned to the left of the desk.",
                        "The lamp can be found hovering above the backpack, which is situated to the left of the trash bin.",
                        "The lamp can be found directly above the backpack that is situated to the left of another backpack.",
                        "The lamp is situated adjacent to the bed, suspended above the backpack.",
                        "The lamp can be found above the backpack that is to the right of another backpack.",
                        "The lamp can be found hovering above the backpack, which is nestled to the right of the wardrobe.",
                        "The lamp can be found hovering above the backpack, which is positioned in front of the shoe.",
                        "The lamp is situated above the backpack, which is currently resting on the floor.",
                        "The lamp is situated above the backpack, which is positioned to the right of the refrigerator.",
                        "The lamp, situated at a comfortable height above the light switch and positioned on the wall, casts a warm glow over the surrounding area, creating an inviting atmosphere perfect for relaxation or reading a book on the adjacent shelf."
                    ],
                    "template": [
                        "The backpack is in front of the case , while The lamp is above the backpack",
                        "The backpack is to the left of the sofa , while The lamp is above the backpack",
                        "The backpack is to the left of the sofa , and The lamp is above the backpack",
                        "The backpack is to the left of the table , while The lamp is above the backpack",
                        "The backpack is to the left of the desk , while The lamp is above the backpack",
                        "The backpack is to the left of the trash bin , and The lamp is above the backpack",
                        "The backpack is to the left of another backpack , and The lamp is above the backpack",
                        "The backpack is close to the bed , while above the backpack is the lamp",
                        "The backpack is to the right of another backpack , and The lamp is above the backpack",
                        "The backpack is to the right of the wardrobe , while The lamp is above the backpack",
                        "in front of the shoe is the backpack , while The lamp is above the backpack",
                        "The backpack is on the floor , and The lamp is above the backpack",
                        "The backpack is to the right of the refrigerator , and The lamp is above the backpack",
                        "The lamp is hung on the wall  and is higher than shelf, also is above light switch ."
                    ],
                    "obj_cap": [
                        "The lamp is a black, spherical, metal wall lamp with a black shade and a white bulb. It can be used to light up a room and has a shiny texture."
                    ],
                    "anno": [
                        "Between the bed and the wardrobe, hanging at the top of the bedside table, is a black lamp emitting a bright yellow light."
                    ]
                }
            },
            {
                "id": 23,
                "label": "lamp",
                "position": [
                    2.1711004999999997,
                    1.7809915,
                    0.4123565
                ],
                "size": [
                    0.17758299999999982,
                    0.17694900000000002,
                    0.23727900000000002
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_23.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The lamp is situated above the backpack, which is positioned in front of the case.",
                        "The lamp is positioned above the backpack, which is placed in front of the sofa.",
                        "The lamp is positioned above the backpack, which is situated in front of the sofa.",
                        "The lamp is positioned above the backpack, which is situated in front of the table.",
                        "The lamp is positioned above the backpack, which is located to the left of the desk.",
                        "The lamp is situated above the backpack, which is located to the left of the trash bin.",
                        "The lamp is situated above the backpack, which is next to the bed.",
                        "The lamp can be found nestled above the backpack, slightly elevated and to the right of its companion bag.",
                        "The lamp is situated above the backpack, which is to the right of the wardrobe.",
                        "The lamp is situated above the backpack, which is positioned to the right of the shoe.",
                        "The lamp is positioned at a higher elevation than the backpack, which is situated on the floor.",
                        "The lamp is situated above the backpack, which is positioned to the right of the refrigerator.",
                        "The lamp, positioned above the power outlet and backpack, casts a warm glow over the space, its soft light creating a cozy atmosphere for relaxation and activity.",
                        "The lamp, functioning as both a source of light and a decorative piece, is strategically positioned above the backpack and shelf, taking advantage of the vertical space and creating a sense of openness in the room, while also being easily accessible and comfortable for human use, is hung on the wall, providing a warm and inviting ambiance."
                    ],
                    "template": [
                        "The backpack is in front of the case , while The lamp is higher than the backpack",
                        "The backpack is in front of the sofa , while The lamp is higher than the backpack",
                        "The backpack is in front of the sofa , and The lamp is higher than the backpack",
                        "The backpack is in front of the table , and The lamp is higher than the backpack",
                        "The backpack is to the left of the desk , while The lamp is higher than the backpack",
                        "The backpack is to the left of the trash bin , and The lamp is higher than the backpack",
                        "The backpack is next to the bed , while The lamp is higher than the backpack",
                        "The backpack is to the right of another backpack , while The lamp is higher than the backpack",
                        "The backpack is to the right of the wardrobe , while The lamp is higher than the backpack",
                        "The backpack is to the right of the shoe , while The lamp is higher than the backpack",
                        "The backpack is placed on the floor , while The lamp is higher than the backpack",
                        "The backpack is to the right of the refrigerator , and The lamp is higher than the backpack",
                        "The lamp is hung on the wall , and The lamp is higher than the power outlet and backpack  .",
                        "The lamp is higher than the backpack and shelf , it is also hung on wall ."
                    ],
                    "obj_cap": [
                        "The lamp is a white or black lamp with a white or black shade, made of teflon or styrofoam, and has a matte finish. It is used to light up a room and can be used as a bedside lamp. The structure is a metal lamp with a glass shade, and it has a square shape or a light bulb."
                    ],
                    "anno": [
                        "On the white bedside of the bedroom, there is a silver wall lamp hanging on the wall next to the gray curtain."
                    ]
                }
            },
            {
                "id": 24,
                "label": "backpack",
                "position": [
                    -0.7021185,
                    1.6120695,
                    -1.1491885
                ],
                "size": [
                    0.336349,
                    0.40375099999999997,
                    0.3404250000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_24.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The backpack can be found to the left of the bed, which is lower than the picture.",
                        "The backpack is situated below the lamp, aligned with its base.",
                        "The backpack can be found nestled beneath the lamp, situated to the left of a similar backpack.",
                        "The backpack is situated adjacent to the light switch, making it easily accessible.",
                        "The backpack can be found to the right of the refrigerator, which is situated below the clothes hanger.",
                        "The backpack lies adjacent to the refrigerator, which is positioned below the blanket.",
                        "The backpack is situated to the left of the power outlet, at a lower height than the outlet.",
                        "The backpack, a sturdy and spacious container for carrying essential items, is positioned to the left of the lamp, creating a comfortable and accessible workspace alongside the desk.",
                        "The backpack, a sturdy and spacious bag with multiple compartments for organization, sits comfortably on the floor, positioned to the left of another backpack and to the right of a sleek refrigerator, within easy reach for grabbing essentials for a quick snack or meal prep."
                    ],
                    "template": [
                        "The bed is lower than the picture , and to the left of the bed is the backpack",
                        "The backpack is lower than the lamp , while The backpack is to the left of another backpack",
                        "below the lamp is the backpack , and The backpack is to the left of another backpack",
                        "The backpack is below the light switch , and The backpack is to the left of another backpack",
                        "The refrigerator is lower than the clothes hanger , and The backpack is to the right of the refrigerator",
                        "The refrigerator is lower than the blanket , and The backpack is to the right of the refrigerator",
                        "The backpack is lower than the power outlet , while to the left of the backpack is another backpack",
                        "The backpack is to the left of the lamp and backpack and desk .",
                        "The backpack is placed on the floor  and is to the left of backpack, also is to the right of refrigerator ."
                    ],
                    "obj_cap": [
                        "The backpack is blue, oblong, and made of nylon. It can be used as a laptop bag and carry-on bag, and has a zippered compartment. It has a smooth, dark blue texture and is structured as a backpack with a zippered compartment."
                    ],
                    "anno": [
                        "In the bedroom, a square black backpack is placed near the bedside table that is far from the window."
                    ]
                }
            },
            {
                "id": 25,
                "label": "backpack",
                "position": [
                    -0.3868515,
                    1.5568205000000002,
                    -1.1747565
                ],
                "size": [
                    0.48804899999999996,
                    0.5281290000000001,
                    0.34413099999999996
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_25.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The backpack is situated near the bed, which is positioned lower than the picture.",
                        "The backpack is situated beneath the lamp, slightly to the right of a nearby chair.",
                        "The backpack rests beneath the lamp, its canvas exterior gently glowing in the soft light.",
                        "The backpack can be found to the right of the refrigerator, which is located below the clothes hanger.",
                        "The backpack is located to the right of the refrigerator, which is situated lower than the blanket.",
                        "The backpack is situated beneath the power outlet, nested among other items in the vicinity.",
                        "The backpack rests conveniently near the bed, situated to the right of the refrigerator and left of the sofa, within easy reach and offering ample storage for various items, ensuring comfort and practicality for the user.",
                        "The backpack rests comfortably on the floor, nestled between the bed and wardrobe, within easy reach of the table, ready to serve its purpose as a reliable companion for any adventure."
                    ],
                    "template": [
                        "lower than the picture is the bed , and The backpack is close to the bed",
                        "The backpack is below the lamp , and The backpack is to the left of another backpack",
                        "The lamp is higher than the shelf , while The backpack is lower than the lamp",
                        "The refrigerator is lower than the clothes hanger , while The backpack is to the right of the refrigerator",
                        "The refrigerator is lower than the blanket , while The backpack is to the right of the refrigerator",
                        "The backpack is lower than the power outlet , while The backpack is to the left of another backpack",
                        "The backpack is close to the bed  and is to the right of refrigerator, also is to the left of sofa .",
                        "The backpack is close to the bed  and is to the right of wardrobe, also is to the left of table ."
                    ],
                    "obj_cap": [
                        "The backpack is a black, leather laptop bag with an oblong shape and a structured design. It has a laptop compartment and is used to carry laptops. The texture is leather and the material is leather."
                    ],
                    "anno": [
                        "In the middle of the bed and wardrobe, in front of the bedside table with a switch and iPad, next to the deep blue backpack, there is an open black handbag with many miscellaneous items inside."
                    ]
                }
            },
            {
                "id": 26,
                "label": "shelf",
                "position": [
                    -0.496732,
                    1.740108,
                    -0.8536325
                ],
                "size": [
                    0.5277580000000001,
                    0.19762600000000008,
                    0.377421
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_26.ply",
                "count": 4,
                "caption": {
                    "rewrite": [
                        "The shelf can be found beneath the lamp, which is positioned above the backpack.",
                        "The shelf, located below the light switch and hanging on the wall, is positioned lower than the lamp, providing ample storage space for various objects while ensuring easy accessibility and functionality.",
                        "The wall-mounted shelf, located beneath the light switch and positioned lower than the lamp, provides ample storage space for various objects while ensuring a comfortable reach for humans."
                    ],
                    "template": [
                        "The lamp is above the backpack , while The shelf is lower than the lamp",
                        "The shelf is lower than the lamp  and is below light switch, also is hanging on wall .",
                        "The shelf is below the light switch  and is lower than lamp, also is hanging on wall ."
                    ],
                    "obj_cap": [
                        "White wooden shelf with two drawers, used for storing electronics such as Nintendo Switch controllers and other devices."
                    ],
                    "anno": [
                        "Facing the direction of the double bed, there is a wooden shelf below the power outlet on the left side of the double bed."
                    ]
                }
            },
            {
                "id": 27,
                "label": "light switch",
                "position": [
                    -0.4605275,
                    1.8115195,
                    -0.455139
                ],
                "size": [
                    0.04863899999999999,
                    0.05079900000000004,
                    0.105568
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_27.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The light switch is situated above the backpack, which is positioned in front of the case.",
                        "The light switch is situated above the backpack, which is to the left of the sofa.",
                        "The light switch is situated above the backpack, which is to the left of the sofa.",
                        "The light switch floats gracefully above the backpack, like a celestial body hovering in the darkness, waiting to be discovered.",
                        "The light switch is situated above the backpack, which is positioned to the left of the desk.",
                        "Atop the heap of discarded rubbish, a shining beacon awaits, its luminescent glow casting a faint light on the surrounding detritus, a celestial guidepost to the heavens, a.k.a. the light switch, placed precariously above the mundane backpack, a leftward leaning sentinel, watching over the waste below.",
                        "The light switch is situated above the backpack, to the left of the other backpack.",
                        "The light switch floats above the backpack, like a beacon guiding you to illuminate your surroundings.",
                        "The light switch is situated above the backpack, which is to the right of another backpack.",
                        "The light switch is situated above the backpack, which is to the right of the wardrobe.",
                        "The light switch is situated above the backpack, which is positioned in front of the shoe.",
                        "The light switch is situated above the backpack, which is to the left of the lamp.",
                        "The light switch floats above the backpack like a celestial body, beckoning you to reach out and flip the switch to illuminate the room.",
                        "The light switch is situated above the backpack, which is positioned to the right of the refrigerator.",
                        "The light switch, placed at a comfortable height above the backpack and shelf, allows for easy access and control over the lighting in the room, creating a cozy and functional space for human activity."
                    ],
                    "template": [
                        "in front of the case is the backpack , and higher than the backpack is the light switch",
                        "The backpack is to the left of the sofa , while The light switch is higher than the backpack",
                        "to the left of the sofa is the backpack , while The light switch is higher than the backpack",
                        "The backpack is to the left of the table , and The light switch is higher than the backpack",
                        "The backpack is to the left of the desk , and The light switch is higher than the backpack",
                        "The backpack is to the left of the trash bin , and higher than the backpack is the light switch",
                        "The backpack is to the left of another backpack , while The light switch is higher than the backpack",
                        "close to the bed is the backpack , while The light switch is higher than the backpack",
                        "The backpack is to the right of another backpack , and The light switch is higher than the backpack",
                        "The backpack is to the right of the wardrobe , and The light switch is higher than the backpack",
                        "The backpack is in front of the shoe , and The light switch is higher than the backpack",
                        "to the left of the lamp is the backpack , and The light switch is higher than the backpack",
                        "The backpack is on the floor , and The light switch is higher than the backpack",
                        "The backpack is to the right of the refrigerator , while higher than the backpack is the light switch",
                        "The light switch is hung on the wall , and The light switch is higher than the backpack and shelf  ."
                    ],
                    "obj_cap": [
                        "The light switch is a white, octagon-shaped plastic or stainless steel device used to turn on and off a light. It has a smooth texture and is typically mounted on a wall."
                    ],
                    "anno": [
                        "Standing at the foot of the bed, facing the head of the bed, the white square socket on the left side of the wall, closest to the head of the bed, is the white charger."
                    ]
                }
            },
            {
                "id": 28,
                "label": "wardrobe",
                "position": [
                    -1.550165,
                    1.337279,
                    -0.23990199999999995
                ],
                "size": [
                    0.9848300000000001,
                    1.0704879999999999,
                    2.1319939999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_28.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The wardrobe can be found to the left of the bed, situated below the picture.",
                        "The wardrobe is situated to the left of the backpack, which is positioned beneath the lamp.",
                        "The wardrobe can be found situated to the left of the backpack, which is positioned below the lamp.",
                        "Locate the light switch, then glance left to spot the wardrobe, nestled beside the backpack.",
                        "The wardrobe is situated to the left of the backpack, which is positioned below the power outlet.",
                        "The wardrobe, a sleek and modern piece of furniture, stands tall and proud to the left of the table and bed, its doors opening to reveal a spacious interior perfect for storing a variety of clothes, shoes, and accessories, while also serving as a convenient and stylish addition to the room's overall decor.",
                        "The wardrobe, located to the left of the bed and sofa, serves as a convenient storage space for clothing and other personal items, while also adding a touch of style and functionality to the room, with its comfortable and spacious design allowing for easy access and use."
                    ],
                    "template": [
                        "lower than the picture is the bed , while to the left of the bed is the wardrobe",
                        "The backpack is lower than the lamp , while to the left of the backpack is the wardrobe",
                        "below the lamp is the backpack , and The wardrobe is to the left of the backpack",
                        "The backpack is below the light switch , while to the left of the backpack is the wardrobe",
                        "The backpack is lower than the power outlet , while The wardrobe is to the left of the backpack",
                        "The wardrobe is to the left of the table and bed , what's more, The wardrobe is above the refrigerator  .",
                        "The wardrobe is to the left of the bed and sofa , what's more, The wardrobe is above the refrigerator  ."
                    ],
                    "obj_cap": [
                        "The wardrobe is a rectangular-shaped closet made of wood, used for storing clothes. It has a black and white color scheme and a smooth, wooden texture. The structure consists of a frame with hangers or rods for hanging clothes, creating a spacious and organized storage space for your wardrobe."
                    ],
                    "anno": [
                        "Facing the direction of the double bed, the top surface of the wardrobe on the left side of the double bed."
                    ]
                }
            },
            {
                "id": 29,
                "label": "clothes",
                "position": [
                    -1.5302595,
                    1.5198575,
                    -0.267235
                ],
                "size": [
                    0.9445129999999999,
                    0.620817,
                    1.321504
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_29.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The blanket hangs above the clothes hanger, while the clothes are positioned below it.",
                        "The clothes are nestled beneath the blanket, like a treasure waiting to be discovered.",
                        "The clothes can be found beneath the blanket, which is situated above the refrigerator."
                    ],
                    "template": [
                        "higher than the clothes hanger is the blanket , while The clothes is lower than the blanket",
                        "The blanket is above another blanket , while The clothes is lower than the blanket",
                        "The blanket is above the refrigerator , and The clothes is lower than the blanket"
                    ],
                    "obj_cap": [
                        "The clothes are primarily white, with some orange and black accents. They are made of materials such as teflon and cotton. The clothes are mostly oblong in shape and have a soft texture. They are used for various activities such as camping, storing clothes, and cruises. The structure of the clothes is mostly closet-like, with clothes stacked on top of each other."
                    ],
                    "anno": [
                        "Facing the white bed, there is a row of clothes hanging in the wardrobe on the left side of the bed."
                    ]
                }
            },
            {
                "id": 30,
                "label": "clothes hanger",
                "position": [
                    -1.9838755,
                    1.5059135000000001,
                    0.2237615
                ],
                "size": [
                    0.06608299999999989,
                    0.290173,
                    0.309315
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_30.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "Locating a clothes hanger in relation to a case, one might spot it placed above the refrigerator, which lies far to the left of the case.",
                        "Locate the refrigerator to the right of the sofa, and you'll find the clothes hanger hovering above it like a stylish guardian angel.",
                        "The clothes hanger can be found above the refrigerator, which is located to the left of the sofa.",
                        "The clothes hanger can be found suspended above the refrigerator, which is situated to the left of the table.",
                        "The clothes hanger floats majestically above the refrigerator, like a proud bird soaring in the sky.",
                        "The clothes hanger can be found above the refrigerator, which is located to the left of the trash bin.",
                        "The clothes hanger can be found above the refrigerator, which is located to the left of the backpack.",
                        "The clothes hanger floats majestically above the refrigerator, like a celestial body suspended in mid-air, patiently awaiting its next terrestrial assignment.",
                        "Locating the clothes hanger from the backpack, you can start by facing the case and looking to the right, where the refrigerator is positioned, and then look upwards to find the hanger placed above the fridge.",
                        "The clothes hanger can be found directly above the refrigerator, which is located to the left of the backpack.",
                        "The clothes hanger floats majestically above the wardrobe, like a celestial body hovering in the vast expanse of space.",
                        "The clothes hanger is situated beneath the blanket, acting as a supportive foundation for the garments.",
                        "Locate the refrigerator to the left of the shoe, and then look above it to find the clothes hanger.",
                        "The clothes hanger can be found above the refrigerator, which is located to the right of the lamp.",
                        "The clothes hanger floats gracefully above the refrigerator, inviting you to grab it and hang your garments with ease."
                    ],
                    "template": [
                        "Standing in front of the backpack, The refrigerator is far to the left of the case , while The clothes hanger is above the refrigerator",
                        "Facing towards the shoe, The refrigerator is far to the right of the sofa , and The clothes hanger is above the refrigerator",
                        "The refrigerator is to the left of the sofa , and The clothes hanger is above the refrigerator",
                        "to the left of the table is the refrigerator , while The clothes hanger is above the refrigerator",
                        "The refrigerator is to the left of the desk , and The clothes hanger is above the refrigerator",
                        "The refrigerator is to the left of the trash bin , and above the refrigerator is the clothes hanger",
                        "The refrigerator is to the left of the backpack , and above the refrigerator is the clothes hanger",
                        "to the left of the bed is the refrigerator , and The clothes hanger is above the refrigerator",
                        "Facing the case, The refrigerator is close to the right of the backpack , and The clothes hanger is above the refrigerator",
                        "The refrigerator is to the left of the backpack , while The clothes hanger is above the refrigerator",
                        "The refrigerator is above the wardrobe , and The clothes hanger is above the refrigerator",
                        "The blanket is above the clothes , while The clothes hanger is below the blanket",
                        "Directly facing the lamp, The refrigerator is far to the left of the shoe , while The clothes hanger is above the refrigerator",
                        "Directly facing the shoe, The refrigerator is far to the right of the lamp , while The clothes hanger is above the refrigerator",
                        "The refrigerator is resting on the floor , and The clothes hanger is above the refrigerator"
                    ],
                    "obj_cap": [
                        "The clothes hanger is a wooden, triangular-shaped hanger with a brown or black finish, used to hang clothes in a closet. It has a wooden texture and a simple structure, made of wood."
                    ],
                    "anno": [
                        "Facing the dining table, standing in front of the wardrobe beside the bedroom bed, the leftmost area of the wardrobe for hanging clothes, there is no hanger with clothes."
                    ]
                }
            },
            {
                "id": 31,
                "label": "blanket",
                "position": [
                    -1.8912054999999999,
                    1.5917485,
                    0.578956
                ],
                "size": [
                    0.2505909999999998,
                    0.5059070000000001,
                    0.13686200000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_31.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "Locate the refrigerator far to the left of the case, and you'll find the blanket directly above it.",
                        "The blanket is situated above the refrigerator, which is located to the right of the sofa.",
                        "The blanket is situated atop the refrigerator, which lies to the left of the sofa.",
                        "The blanket is situated above the refrigerator, which is located to the left of the table.",
                        "The blanket is situated above the refrigerator, which is located to the left of the desk.",
                        "The blanket is situated above the refrigerator, which is to the left of the trash bin.",
                        "The blanket is situated atop the refrigerator, which is located to the left of the backpack.",
                        "The blanket can be found draped across the top of the bed, situated above the refrigerator to the left.",
                        "The blanket can be found above the refrigerator, which is located near the right side of the backpack.",
                        "The blanket can be found by looking upwards from the refrigerator, which is located to the left of the backpack.",
                        "The blanket is situated above the wardrobe, adjacent to the refrigerator.",
                        "The blanket can be found above the refrigerator, which is located to the left of the shoe, facing towards the lamp.",
                        "Locating the blanket from the lamp, you'll find it directly above the refrigerator, which is positioned to the right of the lamp.",
                        "The blanket is situated above the refrigerator, which is resting on the floor.",
                        "Perched atop the refrigerator, a cozy blanket is nestled comfortably above its sleek surface, boasting a higher vantage point than the nearby clothes hanger.",
                        "The cozy blanket is artistically draped over the refrigerator, adding a pop of color and texture to the room while also serving as a decorative accent piece, and its softness and warmth invite snuggling while watching a movie or enjoying a meal."
                    ],
                    "template": [
                        "Facing towards the backpack, The refrigerator is far to the left of the case , and The blanket is above the refrigerator",
                        "Facing the shoe, The refrigerator is far to the right of the sofa , and above the refrigerator is the blanket",
                        "The refrigerator is to the left of the sofa , and The blanket is above the refrigerator",
                        "The refrigerator is to the left of the table , and The blanket is above the refrigerator",
                        "to the left of the desk is the refrigerator , and The blanket is above the refrigerator",
                        "The refrigerator is to the left of the trash bin , while The blanket is above the refrigerator",
                        "to the left of the backpack is the refrigerator , and The blanket is above the refrigerator",
                        "The refrigerator is to the left of the bed , while The blanket is above the refrigerator",
                        "Facing towards the case, The refrigerator is close to the right of the backpack , while The blanket is above the refrigerator",
                        "The refrigerator is to the left of the backpack , while The blanket is above the refrigerator",
                        "The refrigerator is above the wardrobe , while The blanket is above the refrigerator",
                        "Facing towards the lamp, The refrigerator is far to the left of the shoe , and The blanket is above the refrigerator",
                        "Facing the shoe, The refrigerator is far to the right of the lamp , while The blanket is above the refrigerator",
                        "The refrigerator is resting on the floor , while The blanket is above the refrigerator",
                        "above the blanket and refrigerator is the blanket , it is also higher than clothes hanger .",
                        "The blanket is above the refrigerator and blanket , what's more, The blanket is hanging on the wall  ."
                    ],
                    "obj_cap": [
                        "The blanket is blue, triangular in shape, made of cotton, and can be used as a towel or bed cover. It has a soft, fluffy texture and is folded in half."
                    ],
                    "anno": [
                        "Facing the white bed, on the left side of the bed is a wardrobe. On the top of the wardrobe is a blue shirt."
                    ]
                }
            },
            {
                "id": 32,
                "label": "bag",
                "position": [
                    -1.314565,
                    1.531871,
                    -0.9015994999999999
                ],
                "size": [
                    0.37016800000000005,
                    0.541194,
                    0.286207
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_32.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The bag is a plastic, oblong-shaped bag used for storing clothes in a closet. It has a smooth texture and is made of plastic material."
                    ],
                    "anno": [
                        "Facing the left side of the bed, below the white bathrobe is a gray bag."
                    ]
                }
            },
            {
                "id": 33,
                "label": "shoe",
                "position": [
                    -3.079136,
                    -1.5698625,
                    -1.3076965
                ],
                "size": [
                    0.43710799999999983,
                    0.23406100000000007,
                    0.10316100000000006
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_33.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The shoe can be found to the left of the bed, which is positioned lower than the picture.",
                        "The shoe is concealed behind the backpack, which is positioned lower than the lamp.",
                        "The shoe can be found to the left of the backpack, which is situated below the lamp.",
                        "Behind the backpack, which is situated below the light switch, lies the shoe.",
                        "Behind the refrigerator, which is positioned lower than the clothes hanger, you'll find the shoe.",
                        "The shoe is concealed behind the refrigerator, which is positioned lower than the blanket.",
                        "The shoe is situated to the left of the backpack, which is positioned below the power outlet.",
                        "The shoe, positioned to the left of the sofa and trash bin, rests comfortably on the floor's surface, awaiting its function as a supportive footwear for human activity.",
                        "The shoe, nestled behind the backpack and wardrobe, sits atop the floor, waiting to be worn for its intended purpose, providing comfort and support for the wearer's feet during various human activities."
                    ],
                    "template": [
                        "The bed is lower than the picture , and The shoe is to the left of the bed",
                        "lower than the lamp is the backpack , while The shoe is behind the backpack",
                        "The backpack is below the lamp , while The shoe is to the left of the backpack",
                        "below the light switch is the backpack , while The shoe is behind the backpack",
                        "lower than the clothes hanger is the refrigerator , and The shoe is behind the refrigerator",
                        "The refrigerator is lower than the blanket , and The shoe is behind the refrigerator",
                        "The backpack is lower than the power outlet , while The shoe is to the left of the backpack",
                        "The shoe is to the left of the sofa and trash bin , what's more, The shoe is on the top of the floor  .",
                        "The shoe is behind the backpack and wardrobe , it is also on the top of floor ."
                    ],
                    "obj_cap": [
                        "The shoe is a brown leather shoe with a brown leather sole, featuring an octagonal shape and a smooth texture. It can be used for walking or running, and has a sleek and modern design."
                    ],
                    "anno": [
                        "In the bedroom, facing away from the head of the bed, on the gray floor in the front right, there is a pair of black shoes leaning against the wall."
                    ]
                }
            },
            {
                "id": 34,
                "label": "lamp",
                "position": [
                    3.7886685,
                    -1.4045554999999998,
                    -0.5890945000000001
                ],
                "size": [
                    0.49061299999999974,
                    0.2114689999999999,
                    1.496975
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_34.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The lamp can be found to the right of the bed, which is positioned lower than the picture.",
                        "The lamp can be found to the right of the backpack, which is located below the light switch.",
                        "The lamp is positioned adjacent to the right side of the refrigerator, which is situated below the height of the clothes hanger.",
                        "The lamp is situated to the right of the refrigerator, adjacent to the trash bin, and can be accessed by moving aside the blanket that covers it.",
                        "The lamp is situated behind the backpack, which is positioned below the power outlet.",
                        "The lamp, positioned behind the trash bin and on the floor to the right of the wardrobe, illuminates the area surrounding the table with a warm and comfortable glow, perfect for reading or working.",
                        "The lamp, located to the right of the case and wardrobe, casts a warm glow on the surrounding area, its soft light illuminating the space behind the trash bin."
                    ],
                    "template": [
                        "The bed is lower than the picture , while The lamp is to the right of the bed",
                        "below the light switch is the backpack , while The lamp is to the right of the backpack",
                        "The refrigerator is lower than the clothes hanger , and Standing in front of the trash bin, The lamp is to the right of the refrigerator",
                        "The refrigerator is lower than the blanket , and Facing the trash bin, The lamp is to the right of the refrigerator",
                        "The backpack is lower than the power outlet , while The lamp is behind the backpack",
                        "Facing the table, The lamp is behind the trash bin  and is on floor, also is to the right of wardrobe .",
                        "Facing towards the table, The lamp is to the right of the case and wardrobe , what's more, The lamp is behind the trash bin  ."
                    ],
                    "obj_cap": [
                        "The lamp is a white, octagonal, metal floor lamp with a shiny finish and a glass shade. It can be used to light up a room and can also be used as a bedside lamp."
                    ],
                    "anno": [
                        "Facing the curtains below the air conditioner, there is a glowing light fixture and its black base on the right side."
                    ]
                }
            },
            {
                "id": 35,
                "label": "curtain",
                "position": [
                    4.0757905,
                    0.06945000000000001,
                    -0.2227555
                ],
                "size": [
                    0.3422590000000003,
                    3.56315,
                    2.2236029999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_35.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The curtain is a grey, rectangular linen curtain used to cover a window. It has a light grey fabric and hangs from the ceiling."
                    ],
                    "anno": [
                        "In front of two gray single sofas, there are gray curtains."
                    ]
                }
            },
            {
                "id": 36,
                "label": "wall",
                "position": [
                    4.202051,
                    0.08264899999999997,
                    0.43551599999999996
                ],
                "size": [
                    0.11280200000000029,
                    3.554882,
                    1.8553639999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_36.ply"
            },
            {
                "id": 37,
                "label": "wall",
                "position": [
                    -1.9850444999999999,
                    0.596301,
                    0.010441000000000034
                ],
                "size": [
                    0.1904450000000002,
                    2.499046,
                    2.6979040000000003
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_37.ply"
            },
            {
                "id": 38,
                "label": "floor",
                "position": [
                    -0.03258849999999969,
                    0.06672250000000002,
                    -1.2371455
                ],
                "size": [
                    8.314661000000001,
                    3.572625,
                    0.3219590000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_38.ply",
                "count": 1,
                "caption": ""
            },
            {
                "id": 39,
                "label": "ceiling",
                "position": [
                    1.0890084999999998,
                    0.08461050000000003,
                    1.340541
                ],
                "size": [
                    6.312359,
                    3.588729,
                    0.11269600000000013
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_39.ply"
            },
            {
                "id": 40,
                "label": "conditioner bottle",
                "position": [
                    4.138289,
                    0.15677249999999998,
                    1.096894
                ],
                "size": [
                    0.20217600000000058,
                    0.912067,
                    0.4317440000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_40.ply",
                "count": 1,
                "caption": {
                    "obj_cap": [
                        "The conditioner bottle is a white, plastic, spherical bottle with a white label and a cap. It can be used to wash and moisturize hair, and has a smooth texture and a cylindrical shape."
                    ],
                    "anno": [
                        "Facing the direction of the gray curtains, there is a white air conditioner above the curtains."
                    ]
                }
            },
            {
                "id": 41,
                "label": "ipad",
                "position": [
                    0.183711,
                    0.9228689999999999,
                    -0.650371
                ],
                "size": [
                    0.296682,
                    0.26377400000000006,
                    0.01241800000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_41.ply",
                "count": 1,
                "caption": {
                    "anno": [
                        "Black square tablet for entertainment on the white rectangular bed in the bedroom."
                    ]
                }
            },
            {
                "id": 42,
                "label": "power outlet",
                "position": [
                    2.163455,
                    1.850689,
                    -0.47368750000000004
                ],
                "size": [
                    0.08813000000000004,
                    0.01046999999999998,
                    0.10685499999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_42.ply",
                "count": 2,
                "caption": {
                    "rewrite": [
                        "The power outlet can be found above the backpack, which is situated in front of the case.",
                        "The power outlet can be found above the backpack, which is positioned in front of the sofa.",
                        "Locate the backpack in front of the sofa, then look above it to find the power outlet.",
                        "The power outlet is situated above the backpack, which is positioned in front of the table.",
                        "The power outlet is situated above the backpack, which is positioned to the left of the desk.",
                        "The power outlet can be found above the backpack, which is situated to the left of the trash bin.",
                        "The power outlet can be found below the lamp, which is positioned higher than the shelf.",
                        "The power outlet can be found above the backpack, which is located next to the bed.",
                        "Above the backpack, you'll find the power outlet, conveniently located for charging your devices on the go.",
                        "The power outlet can be found above the backpack, which is located to the right of the wardrobe.",
                        "The power outlet can be found directly above the backpack, which is situated to the right of the shoe.",
                        "The power outlet can be found above the backpack, which is positioned in front of the lamp.",
                        "The power outlet can be found hovering majestically above the backpack, like a celestial body suspended in mid-air.",
                        "Locate the backpack to the right of the refrigerator, and you'll find the power outlet situated above it.",
                        "The power outlet, located above the backpack and below the lamp, hangs conveniently on the wall, allowing for easy access to charge electronic devices, providing a comfortable and functional power source for human activity in the scene.",
                        "The power outlet, positioned above the backpack and hung on the wall, functions as a convenient and accessible source of electricity, providing a comfortable and safe level of power for various human activities, such as charging electronic devices, and its location allows for easy access and use without obstructing the surrounding area."
                    ],
                    "template": [
                        "The backpack is in front of the case , and The power outlet is above the backpack",
                        "The backpack is in front of the sofa , while The power outlet is above the backpack",
                        "The backpack is in front of the sofa , while The power outlet is above the backpack",
                        "The backpack is in front of the table , while The power outlet is above the backpack",
                        "The backpack is to the left of the desk , while The power outlet is above the backpack",
                        "The backpack is to the left of the trash bin , while The power outlet is above the backpack",
                        "The lamp is higher than the shelf , and The power outlet is lower than the lamp",
                        "next to the bed is the backpack , while The power outlet is above the backpack",
                        "to the right of the backpack is another backpack , while The power outlet is above the backpack",
                        "The backpack is to the right of the wardrobe , and The power outlet is above the backpack",
                        "The backpack is to the right of the shoe , and The power outlet is above the backpack",
                        "The backpack is in front of the lamp , and The power outlet is above the backpack",
                        "The backpack is placed on the floor , and The power outlet is above the backpack",
                        "The backpack is to the right of the refrigerator , while above the backpack is the power outlet",
                        "The power outlet is above the backpack  and is lower than lamp, also is hung on wall .",
                        "The power outlet is above the backpack  and is hung on wall, also is lower than lamp ."
                    ],
                    "obj_cap": [
                        "White, stainless steel wall outlet with a smooth, shiny surface and a triangle or octagon shape, used for charging cell phones."
                    ],
                    "anno": [
                        "On the bedside table on the side of the window curtain, there is an electrical socket directly below the white lamp."
                    ]
                }
            },
            {
                "id": 44,
                "label": "light switch",
                "position": [
                    -2.201889,
                    -1.6606855,
                    -0.289893
                ],
                "size": [
                    0.06555200000000028,
                    0.003766999999999854,
                    0.024038000000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_44.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The light switch is a beige, octagon-shaped single pole switch with two contacts on each side. It is made of stainless steel and has a smooth, shiny texture. It is used to turn on and off a light and is typically mounted on a wall."
                    ],
                    "anno": [
                        "The wallpaper with a red pattern is closest to this wall, next to the gray window, below the white switch, and has a black-gray border."
                    ]
                }
            },
            {
                "id": 45,
                "label": "ceiling light",
                "position": [
                    -1.5804195,
                    0.5804585,
                    1.3298845
                ],
                "size": [
                    0.19965299999999986,
                    0.17399500000000007,
                    0.004927000000000126
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_45.ply",
                "caption": {
                    "obj_cap": [
                        "The ceiling light is a white, circular light with a smooth texture and a circular shape. It is made of plastic and can be used to light up a room, specifically in a bathroom. It has a light bulb in it and is a led ceiling light."
                    ],
                    "anno": [
                        "Facing the head of the bed, on the ceiling between the pink floral wallpaper and the yellow wardrobe on the left side, there are round lights used for illumination."
                    ]
                }
            },
            {
                "id": 46,
                "label": "power outlet",
                "position": [
                    -2.038124,
                    0.5964149999999999,
                    -1.013262
                ],
                "size": [
                    0.002981999999999818,
                    0.09792400000000001,
                    0.15908
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_46.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "White plastic wall outlet with square or octagonal shape, beige texture, and used for charging cell phones."
                    ],
                    "anno": [
                        "Standing at the bed, facing the floral wallpaper on the wall, to the right of the black shoe rack, there is a white socket on the wall."
                    ]
                }
            },
            {
                "id": 47,
                "label": "light switch",
                "position": [
                    -2.0546885,
                    -0.19936500000000001,
                    -0.20738499999999999
                ],
                "size": [
                    0.003715000000000135,
                    0.07194799999999998,
                    0.106268
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_47.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The light switch is a white plastic octagon-shaped wall switch with a smooth surface and a circular shape. It is used to turn on and off the lights in a room."
                    ],
                    "anno": [
                        "On the pink floral wall, the smallest of the two switches is the electrical switch closest to the brown wardrobe."
                    ]
                }
            },
            {
                "id": 48,
                "label": "blanket",
                "position": [
                    -1.730991,
                    1.6583584999999998,
                    -0.6356580000000001
                ],
                "size": [
                    0.5496840000000001,
                    0.35324500000000003,
                    0.1446599999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_48.ply",
                "count": 3,
                "caption": {
                    "rewrite": [
                        "The blanket can be found nestled amongst the clothes, its soft texture distinguishing it from the surrounding garments.",
                        "The blanket can be found beneath the clothes hanger, which is suspended above the refrigerator.",
                        "The cozy blanket rests snugly on the bottom shelf of the wardrobe, nestled beneath the clothes hanger and within easy reach for a quick grab-and-go moment of comfort.",
                        "The cozy blanket is neatly tucked away inside the wardrobe, lying below the clothes hanger and within easy reach for a quick snuggle or nap, offering a comforting embrace and soft texture that invites relaxation."
                    ],
                    "template": [
                        "The blanket is above the clothes , while The blanket is lower than another blanket",
                        "The clothes hanger is above the refrigerator , while The blanket is below the clothes hanger",
                        "The blanket is below the clothes hanger  and is lower than blanket, also is inside wardrobe .",
                        "The blanket is inside the wardrobe  and is lower than blanket, also is below clothes hanger ."
                    ],
                    "obj_cap": [
                        "The blanket is a white, triangular-shaped blanket made of soft material, used for covering beds or sleeping bags, with a smooth texture and a simple structure."
                    ],
                    "anno": [
                        "In the bedroom, on the bed between the yellow wardrobe and the gray sofa, there is a white blanket."
                    ]
                }
            },
            {
                "id": 49,
                "label": "refrigerator",
                "position": [
                    -1.7669540000000001,
                    1.3046615,
                    -1.0197235
                ],
                "size": [
                    0.4717040000000001,
                    0.8316449999999999,
                    0.582659
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_49.ply",
                "count": 1,
                "caption": {
                    "rewrite": [
                        "The refrigerator can be found to the left of the bed, which is lower than the picture.",
                        "The refrigerator can be found to the left of the backpack, which is situated lower than the lamp.",
                        "The refrigerator is situated to the left of the backpack, which is positioned below the lamp.",
                        "The refrigerator is situated to the left of the backpack, which is positioned below the light switch.",
                        "The refrigerator is situated to the left of the backpack, which is positioned below the power outlet.",
                        "The refrigerator, located to the left of the sofa and trash bin, stands at a lower height than the blanket, serving as a convenient and accessible source of cold beverages and food for the comfort of those in the room.",
                        "The refrigerator, a gleaming white appliance adorned with sleek stainless steel handles, sits proudly to the left of the cozy sofa and backpack, its humble presence subtly commanding attention as it keeps your favorite beverages and snacks refreshingly cool, while its lower height seamlessly blends with the surrounding furniture, creating a comfortable and functional living space."
                    ],
                    "template": [
                        "The bed is lower than the picture , and The refrigerator is to the left of the bed",
                        "lower than the lamp is the backpack , and The refrigerator is to the left of the backpack",
                        "The backpack is below the lamp , and The refrigerator is to the left of the backpack",
                        "The backpack is below the light switch , and The refrigerator is to the left of the backpack",
                        "The backpack is lower than the power outlet , while The refrigerator is to the left of the backpack",
                        "The refrigerator is to the left of the sofa and trash bin , it is also lower than blanket .",
                        "The refrigerator is to the left of the backpack and sofa , it is also lower than clothes hanger ."
                    ],
                    "obj_cap": [
                        "The refrigerator is a white, stainless steel, or black mini-fridge with a door that is open, and sometimes has a drawer on the side. It's a small refrigerator with two drawers and has a 3D shape of an octagon, oblong, or a cuboid. The texture is wood, black, or white, and the structure is a small refrigerator with a door that is open. It's a mini-fridge used for storing food and drinks, and it's commonly found in hotel rooms."
                    ],
                    "anno": [
                        "Facing the direction of the double bed, there is a small refrigerator in the bottom left corner of the wardrobe on the left side of the double bed."
                    ]
                }
            },
            {
                "id": 50,
                "label": "blanket",
                "position": [
                    3.1858025000000003,
                    -0.8167115,
                    -0.8972325
                ],
                "size": [
                    0.5195789999999998,
                    0.49401700000000004,
                    0.42923699999999987
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_50.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The blanket is a grey, rectangular blanket made of linen, wool, or a combination of both. It's soft, knitted, and can be used to cover a person's feet or as a blanket. It has a square shape and is made of a combination of wool and cotton. It's a grey blanket with a teddy bear on it, or a white blanket."
                    ],
                    "anno": [
                        "In between two gray single sofas, on the sofa closer to the television, there is a white blanket on the sofa armrest."
                    ]
                }
            },
            {
                "id": 51,
                "label": "card",
                "position": [
                    3.5685200000000004,
                    0.040413000000000004,
                    -0.8370805
                ],
                "size": [
                    0.2302740000000001,
                    0.202818,
                    0.012736999999999998
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_51.ply",
                "count": 1,
                "caption": {
                    "template": [
                        "card is aligned with container, cup"
                    ],
                    "rewrite": [
                        "The container and cup are positioned in harmony, like a carefully crafted puzzle, with the card serving as the final piece that brings the entire arrangement together."
                    ],
                    "obj_cap": [
                        "The card is a red and white credit card with a smooth texture and a cube-shaped 3D structure, made of plastic or acetate, used to identify the location of a person."
                    ],
                    "anno": [
                        "In the room, on the brown square small table between two gray small sofa chairs, there is a white square ticket."
                    ]
                }
            },
            {
                "id": 52,
                "label": "container",
                "position": [
                    3.476649,
                    -0.25587550000000003,
                    -0.7599039999999999
                ],
                "size": [
                    0.16514000000000006,
                    0.157611,
                    0.20840800000000004
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_52.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "A red, oblong plastic container with a smooth texture and a lid, used for storing food or coffee."
                    ],
                    "anno": [
                        "The highest kettle used for holding water is placed on the small table between two single sofas in the bedroom."
                    ]
                }
            },
            {
                "id": 53,
                "label": "cup",
                "position": [
                    3.294645,
                    -0.038335499999999995,
                    -0.8114939999999999
                ],
                "size": [
                    0.1731720000000001,
                    0.125307,
                    0.09303600000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_53.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The cup is a red and white, plastic coffee cup with a smooth texture and a typical cup shape. It is used to hold a cup of water or coffee."
                    ],
                    "anno": [
                        "The cup used for drinking water is on the table between two sofas, farthest from the curtains."
                    ]
                }
            },
            {
                "id": 54,
                "label": "cup",
                "position": [
                    3.5089215,
                    0.13416250000000002,
                    -0.80711
                ],
                "size": [
                    0.14632500000000004,
                    0.160195,
                    0.08514599999999994
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_54.ply",
                "count": 2,
                "caption": {
                    "obj_cap": [
                        "The cup is a red, plastic coffee cup with a handle and a smooth texture. It is used to hold liquids, specifically coffee, and has a spherical shape."
                    ],
                    "anno": [
                        "Facing the closed gray curtains, there is a yellow wooden square table between two gray sofas. On the table, at the top left corner, there is a yellow round small cup."
                    ]
                }
            },
            {
                "id": 55,
                "label": "container",
                "position": [
                    3.6753725,
                    -0.11692099999999998,
                    -0.8259055
                ],
                "size": [
                    0.24201099999999975,
                    0.27099799999999996,
                    0.10433900000000007
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_55.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The container is a plastic container with a lid, made of stainless steel, and has a square shape. It is used to store food and liquids, and its texture is smooth."
                    ],
                    "anno": [
                        "The yellow small table closest to the gray sofa in the bedroom, with a yellow small bag on the table."
                    ]
                }
            },
            {
                "id": 56,
                "label": "container",
                "position": [
                    3.3750204999999998,
                    0.0582275,
                    -0.7948435
                ],
                "size": [
                    0.14670099999999975,
                    0.125253,
                    0.11130899999999999
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_56.ply",
                "count": 3,
                "caption": {
                    "obj_cap": [
                        "The container is a plastic box with a smooth texture and a lid. It can be used to store food or liquids and has a cube-like shape."
                    ],
                    "anno": [
                        "Facing the gray curtains, on the yellow table between the two small sofas in front of the curtains, there is a brown cylindrical container on the left used for water storage."
                    ]
                }
            },
            {
                "id": 57,
                "label": "shelf",
                "position": [
                    -1.815886,
                    -0.18707800000000002,
                    -0.945532
                ],
                "size": [
                    0.507436,
                    0.6595300000000001,
                    0.2403740000000001
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_57.ply",
                "count": 4,
                "caption": {
                    "obj_cap": [
                        "White, octagon-shaped shelf made of stainless steel, wood, or metal, with a smooth texture and a wall-mounted structure, suitable for storing books, shoes, or other items, and can be used in various rooms, including the bathroom."
                    ],
                    "anno": [
                        "In the entrance of the room, there is a black shelf or seating area below the wall with a red pattern."
                    ]
                }
            },
            {
                "id": 58,
                "label": "wall",
                "position": [
                    1.0792784999999998,
                    1.798554,
                    0.01966099999999993
                ],
                "size": [
                    6.2521629999999995,
                    0.17733599999999994,
                    2.717168
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_58.ply"
            },
            {
                "id": 59,
                "label": "wall",
                "position": [
                    0.31157100000000026,
                    -1.7051379999999998,
                    0.015595499999999984
                ],
                "size": [
                    7.851104,
                    0.17128199999999993,
                    2.7459949999999997
                ],
                "mesh": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/obj_mesh/obj_59.ply"
            }
        ],
        "mesh_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/scene_00097_02.ply",
        "seg_file": "/mnt/fillipo/scratch/masaccio/existing_datasets/multiscan/unzipped/scene_00097_02/scene_00097_02.labels.ply",
        "align_mat": 0,
        "scene_cap": [
            "In this room, there is a bed, two windows, three lamps, three blankets, a TV, six pillows, two cups, a curtain, and four shelves. The TV is positioned higher than the shelf, while the sofa is to the right of the bed. One of the pillows is inside the bed, and the bed is located to the left of the sofa. Additionally, the lamp is positioned higher than the power outlet, which is lower than the lamp. The room appears to be a comfortable living space with various objects for relaxation and entertainment.",
            "In this room, there is a trash bin, two windows, a shoe, a clothes hanger, a table, three lamps, three blankets, a bag, three backpacks, an iPad, six pillows, three light switches, a refrigerator, three containers, a curtain, four shelves, and two sofas. The refrigerator is to the left of the backpack, and the clothes hanger is above the blanket. The trash bin is in front of the table, and to the right of the refrigerator. The table is to the right of the shoe, and the light switch is lower than the lamp. The refrigerator is lower than the blanket, and the blanket is above the refrigerator. The room appears to be well-equipped with various objects, providing comfort and functionality for human activities.",
            "In this room, there is a case, a bag, and various other objects. The room is adorned with shelves, sofas, and lamps. The wardrobe and table are positioned to the left, while the backpack is to the right of the shoe. The bed is lower than the picture, and the lamp is higher than the power outlet. The floor supports the sofa, and the lamp is aligned with another lamp. The room appears to be well-equipped and comfortable, with a mix of storage options, seating, and lighting."
        ]
    }
}